nguyenhoabinhworkplace/ESP32_sigmastudio_control/teensy_sigmadsp_example_project_1.1.0/src/SigmaStudioFiles/Simple_SS_Project_145x_146x_INDIRECT_ACCESS_TABLE_IC_1_REG.h
/* ASRC_INPUT7  - Registers (IC 1) */
#define REG_ASRC_INPUT7_IC_1_ADDR                 0xF107
#define REG_ASRC_INPUT7_IC_1_BYTE                 2
#define REG_ASRC_INPUT7_IC_1_VALUE                0x0

/* ASRC_OUT_RATE0  - Registers (IC 1) */
#define REG_ASRC_OUT_RATE0_IC_1_ADDR              0xF140
#define REG_ASRC_OUT_RATE0_IC_1_BYTE              2
#define REG_ASRC_OUT_RATE0_IC_1_VALUE             0x5

/* ASRC_OUT_RATE1  - Registers (IC 1) */
#define REG_ASRC_OUT_RATE1_IC_1_ADDR              0xF141
#define REG_ASRC_OUT_RATE1_IC_1_BYTE              2
#define REG_ASRC_OUT_RATE1_IC_1_VALUE             0x0

/* ASRC_OUT_RATE2  - Registers (IC 1) */
#define REG_ASRC_OUT_RATE2_IC_1_ADDR              0xF142
#define REG_ASRC_OUT_RATE2_IC_1_BYTE              2
#define REG_ASRC_OUT_RATE2_IC_1_VALUE             0x0

/* ASRC_OUT_RATE3  - Registers (IC 1) */
#define REG_ASRC_OUT_RATE3_IC_1_ADDR              0xF143
#define REG_ASRC_OUT_RATE3_IC_1_BYTE              2
#define REG_ASRC_OUT_RATE3_IC_1_VALUE             0x0

/* ASRC_OUT_RATE4  - Registers (IC 1) */
#define REG_ASRC_OUT_RATE4_IC_1_ADDR              0xF144
#define REG_ASRC_OUT_RATE4_IC_1_BYTE              2
#define REG_ASRC_OUT_RATE4_IC_1_VALUE             0x0

/* ASRC_OUT_RATE5  - Registers (IC 1) */
#define REG_ASRC_OUT_RATE5_IC_1_ADDR              0xF145
#define REG_ASRC_OUT_RATE5_IC_1_BYTE              2
#define REG_ASRC_OUT_RATE5_IC_1_VALUE             0x0

/* ASRC_OUT_RATE6  - Registers (IC 1) */
#define REG_ASRC_OUT_RATE6_IC_1_ADDR              0xF146
#define REG_ASRC_OUT_RATE6_IC_1_BYTE              2
#define REG_ASRC_OUT_RATE6_IC_1_VALUE             0x0

/* ASRC_OUT_RATE7  - Registers (IC 1) */
#define REG_ASRC_OUT_RATE7_IC_1_ADDR              0xF147
#define REG_ASRC_OUT_RATE7_IC_1_BYTE              2
#define REG_ASRC_OUT_RATE7_IC_1_VALUE             0x0

/* SOUT_SOURCE0  - Registers (IC 1) */
#define REG_SOUT_SOURCE0_IC_1_ADDR                0xF180
#define REG_SOUT_SOURCE0_IC_1_BYTE                2
#define REG_SOUT_SOURCE0_IC_1_VALUE               0x2

/* SOUT_SOURCE1  - Registers (IC 1) */
#define REG_SOUT_SOURCE1_IC_1_ADDR                0xF181
#define REG_SOUT_SOURCE1_IC_1_BYTE                2
#define REG_SOUT_SOURCE1_IC_1_VALUE               0x2

/* SOUT_SOURCE2  - Registers (IC 1) */
#define REG_SOUT_SOURCE2_IC_1_ADDR                0xF182
#define REG_SOUT_SOURCE2_IC_1_BYTE                2
#define REG_SOUT_SOURCE2_IC_1_VALUE               0x2

/* SOUT_SOURCE3  - Registers (IC 1) */
#define REG_SOUT_SOURCE3_IC_1_ADDR                0xF183
#define REG_SOUT_SOURCE3_IC_1_BYTE                2
#define REG_SOUT_SOURCE3_IC_1_VALUE               0x2

/* SOUT_SOURCE4  - Registers (IC 1) */
#define REG_SOUT_SOURCE4_IC_1_ADDR                0xF184
#define REG_SOUT_SOURCE4_IC_1_BYTE                2
#define REG_SOUT_SOURCE4_IC_1_VALUE               0x2

/* SOUT_SOURCE5  - Registers (IC 1) */
#define REG_SOUT_SOURCE5_IC_1_ADDR                0xF185
#define REG_SOUT_SOURCE5_IC_1_BYTE                2
#define REG_SOUT_SOURCE5_IC_1_VALUE               0x2

/* SOUT_SOURCE6  - Registers (IC 1) */
#define REG_SOUT_SOURCE6_IC_1_ADDR                0xF186
#define REG_SOUT_SOURCE6_IC_1_BYTE                2
#define REG_SOUT_SOURCE6_IC_1_VALUE               0x2

/* SOUT_SOURCE7  - Registers (IC 1) */
#define REG_SOUT_SOURCE7_IC_1_ADDR                0xF187
#define REG_SOUT_SOURCE7_IC_1_BYTE                2
#define REG_SOUT_SOURCE7_IC_1_VALUE               0x2

/* SOUT_SOURCE8  - Registers (IC 1) */
#define REG_SOUT_SOURCE8_IC_1_ADDR                0xF188
#define REG_SOUT_SOURCE8_IC_1_BYTE                2
#define REG_SOUT_SOURCE8_IC_1_VALUE               0x2

/* SOUT_SOURCE9  - Registers (IC 1) */
#define REG_SOUT_SOURCE9_IC_1_ADDR                0xF189
#define REG_SOUT_SOURCE9_IC_1_BYTE                2
#define REG_SOUT_SOURCE9_IC_1_VALUE               0x2

/* SOUT_SOURCE10  - Registers (IC 1) */
#define REG_SOUT_SOURCE10_IC_1_ADDR               0xF18A
#define REG_SOUT_SOURCE10_IC_1_BYTE               2
#define REG_SOUT_SOURCE10_IC_1_VALUE              0x2

/* SOUT_SOURCE11  - Registers (IC 1) */
#define REG_SOUT_SOURCE11_IC_1_ADDR               0xF18B
#define REG_SOUT_SOURCE11_IC_1_BYTE               2
#define REG_SOUT_SOURCE11_IC_1_VALUE              0x2

/* SOUT_SOURCE12  - Registers (IC 1) */
#define REG_SOUT_SOURCE12_IC_1_ADDR               0xF18C
#define REG_SOUT_SOURCE12_IC_1_BYTE               2
#define REG_SOUT_SOURCE12_IC_1_VALUE              0x2

/* SOUT_SOURCE13  - Registers (IC 1) */
#define REG_SOUT_SOURCE13_IC_1_ADDR               0xF18D
#define REG_SOUT_SOURCE13_IC_1_BYTE               2
#define REG_SOUT_SOURCE13_IC_1_VALUE              0x2

/* SOUT_SOURCE14  - Registers (IC 1) */
#define REG_SOUT_SOURCE14_IC_1_ADDR               0xF18E
#define REG_SOUT_SOURCE14_IC_1_BYTE               2
#define REG_SOUT_SOURCE14_IC_1_VALUE              0x2

/* SOUT_SOURCE15  - Registers (IC 1) */
#define REG_SOUT_SOURCE15_IC_1_ADDR               0xF18F
#define REG_SOUT_SOURCE15_IC_1_BYTE               2
#define REG_SOUT_SOURCE15_IC_1_VALUE              0x2

/* SOUT_SOURCE16  - Registers (IC 1) */
#define REG_SOUT_SOURCE16_IC_1_ADDR               0xF190
#define REG_SOUT_SOURCE16_IC_1_BYTE               2
#define REG_SOUT_SOURCE16_IC_1_VALUE              0x2

/* SOUT_SOURCE17  - Registers (IC 1) */
#define REG_SOUT_SOURCE17_IC_1_ADDR               0xF191
#define REG_SOUT_SOURCE17_IC_1_BYTE               2
#define REG_SOUT_SOURCE17_IC_1_VALUE              0x2

/* SOUT_SOURCE18  - Registers (IC 1) */
#define REG_SOUT_SOURCE18_IC_1_ADDR               0xF192
#define REG_SOUT_SOURCE18_IC_1_BYTE               2
#define REG_SOUT_SOURCE18_IC_1_VALUE              0x2

/* SOUT_SOURCE19  - Registers (IC 1) */
#define REG_SOUT_SOURCE19_IC_1_ADDR               0xF193
#define REG_SOUT_SOURCE19_IC_1_BYTE               2
#define REG_SOUT_SOURCE19_IC_1_VALUE              0x2

/* SOUT_SOURCE20  - Registers (IC 1) */
#define REG_SOUT_SOURCE20_IC_1_ADDR               0xF194
#define REG_SOUT_SOURCE20_IC_1_BYTE               2
#define REG_SOUT_SOURCE20_IC_1_VALUE              0x2

/* SOUT_SOURCE21  - Registers (IC 1) */
#define REG_SOUT_SOURCE21_IC_1_ADDR               0xF195
#define REG_SOUT_SOURCE21_IC_1_BYTE               2
#define REG_SOUT_SOURCE21_IC_1_VALUE              0x2

/* SOUT_SOURCE22  - Registers (IC 1) */
#define REG_SOUT_SOURCE22_IC_1_ADDR               0xF196
#define REG_SOUT_SOURCE22_IC_1_BYTE               2
#define REG_SOUT_SOURCE22_IC_1_VALUE              0x2

/* SOUT_SOURCE23  - Registers (IC 1) */
#define REG_SOUT_SOURCE23_IC_1_ADDR               0xF197
#define REG_SOUT_SOURCE23_IC_1_BYTE               2
#define REG_SOUT_SOURCE23_IC_1_VALUE              0x2

