nguyenhoabinhworkplace/ESP32_sigmastudio_control/teensy_sigmadsp_example_project_1.1.0/src/SigmaStudioFiles/Simple_SS_Project_145x_146x_INDIRECT_ACCESS_TABLE_IC_1_REG.h
/* SPDIFTX_INPUT  - Registers (IC 1) */
#define REG_SPDIFTX_INPUT_IC_1_ADDR               0xF1C0
#define REG_SPDIFTX_INPUT_IC_1_BYTE               2
#define REG_SPDIFTX_INPUT_IC_1_VALUE              0x0

/* SERIAL_BYTE_0_0  - Registers (IC 1) */
#define REG_SERIAL_BYTE_0_0_IC_1_ADDR             0xF200
#define REG_SERIAL_BYTE_0_0_IC_1_BYTE             2
#define REG_SERIAL_BYTE_0_0_IC_1_VALUE            0x9000

/* SERIAL_BYTE_0_1  - Registers (IC 1) */
#define REG_SERIAL_BYTE_0_1_IC_1_ADDR             0xF201
#define REG_SERIAL_BYTE_0_1_IC_1_BYTE             2
#define REG_SERIAL_BYTE_0_1_IC_1_VALUE            0x2

/* SERIAL_BYTE_1_0  - Registers (IC 1) */
#define REG_SERIAL_BYTE_1_0_IC_1_ADDR             0xF204
#define REG_SERIAL_BYTE_1_0_IC_1_BYTE             2
#define REG_SERIAL_BYTE_1_0_IC_1_VALUE            0x9000

/* SERIAL_BYTE_1_1  - Registers (IC 1) */
#define REG_SERIAL_BYTE_1_1_IC_1_ADDR             0xF205
#define REG_SERIAL_BYTE_1_1_IC_1_BYTE             2
#define REG_SERIAL_BYTE_1_1_IC_1_VALUE            0x2

/* SERIAL_BYTE_2_0  - Registers (IC 1) */
#define REG_SERIAL_BYTE_2_0_IC_1_ADDR             0xF208
#define REG_SERIAL_BYTE_2_0_IC_1_BYTE             2
#define REG_SERIAL_BYTE_2_0_IC_1_VALUE            0x9000

/* SERIAL_BYTE_2_1  - Registers (IC 1) */
#define REG_SERIAL_BYTE_2_1_IC_1_ADDR             0xF209
#define REG_SERIAL_BYTE_2_1_IC_1_BYTE             2
#define REG_SERIAL_BYTE_2_1_IC_1_VALUE            0x2

/* SERIAL_BYTE_3_0  - Registers (IC 1) */
#define REG_SERIAL_BYTE_3_0_IC_1_ADDR             0xF20C
#define REG_SERIAL_BYTE_3_0_IC_1_BYTE             2
#define REG_SERIAL_BYTE_3_0_IC_1_VALUE            0x6C00

/* SERIAL_BYTE_3_1  - Registers (IC 1) */
#define REG_SERIAL_BYTE_3_1_IC_1_ADDR             0xF20D
#define REG_SERIAL_BYTE_3_1_IC_1_BYTE             2
#define REG_SERIAL_BYTE_3_1_IC_1_VALUE            0x2

/* SERIAL_BYTE_4_0  - Registers (IC 1) */
#define REG_SERIAL_BYTE_4_0_IC_1_ADDR             0xF210
#define REG_SERIAL_BYTE_4_0_IC_1_BYTE             2
#define REG_SERIAL_BYTE_4_0_IC_1_VALUE            0x9000

/* SERIAL_BYTE_4_1  - Registers (IC 1) */
#define REG_SERIAL_BYTE_4_1_IC_1_ADDR             0xF211
#define REG_SERIAL_BYTE_4_1_IC_1_BYTE             2
#define REG_SERIAL_BYTE_4_1_IC_1_VALUE            0x2

/* SERIAL_BYTE_5_0  - Registers (IC 1) */
#define REG_SERIAL_BYTE_5_0_IC_1_ADDR             0xF214
#define REG_SERIAL_BYTE_5_0_IC_1_BYTE             2
#define REG_SERIAL_BYTE_5_0_IC_1_VALUE            0x9000

/* SERIAL_BYTE_5_1  - Registers (IC 1) */
#define REG_SERIAL_BYTE_5_1_IC_1_ADDR             0xF215
#define REG_SERIAL_BYTE_5_1_IC_1_BYTE             2
#define REG_SERIAL_BYTE_5_1_IC_1_VALUE            0x2

/* SERIAL_BYTE_6_0  - Registers (IC 1) */
#define REG_SERIAL_BYTE_6_0_IC_1_ADDR             0xF218
#define REG_SERIAL_BYTE_6_0_IC_1_BYTE             2
#define REG_SERIAL_BYTE_6_0_IC_1_VALUE            0x9000

/* SERIAL_BYTE_6_1  - Registers (IC 1) */
#define REG_SERIAL_BYTE_6_1_IC_1_ADDR             0xF219
#define REG_SERIAL_BYTE_6_1_IC_1_BYTE             2
#define REG_SERIAL_BYTE_6_1_IC_1_VALUE            0x2

/* SERIAL_BYTE_7_0  - Registers (IC 1) */
#define REG_SERIAL_BYTE_7_0_IC_1_ADDR             0xF21C
#define REG_SERIAL_BYTE_7_0_IC_1_BYTE             2
#define REG_SERIAL_BYTE_7_0_IC_1_VALUE            0x9000

/* SERIAL_BYTE_7_1  - Registers (IC 1) */
#define REG_SERIAL_BYTE_7_1_IC_1_ADDR             0xF21D
#define REG_SERIAL_BYTE_7_1_IC_1_BYTE             2
#define REG_SERIAL_BYTE_7_1_IC_1_VALUE            0x2

/* SDATA_0_ROUTE  - Registers (IC 1) */
#define REG_SDATA_0_ROUTE_IC_1_ADDR               0xF240
#define REG_SDATA_0_ROUTE_IC_1_BYTE               2
#define REG_SDATA_0_ROUTE_IC_1_VALUE              0x0

/* SDATA_1_ROUTE  - Registers (IC 1) */
#define REG_SDATA_1_ROUTE_IC_1_ADDR               0xF241
#define REG_SDATA_1_ROUTE_IC_1_BYTE               2
#define REG_SDATA_1_ROUTE_IC_1_VALUE              0x0

/* SDATA_2_ROUTE  - Registers (IC 1) */
#define REG_SDATA_2_ROUTE_IC_1_ADDR               0xF242
#define REG_SDATA_2_ROUTE_IC_1_BYTE               2
#define REG_SDATA_2_ROUTE_IC_1_VALUE              0x0

/* SDATA_3_ROUTE  - Registers (IC 1) */
#define REG_SDATA_3_ROUTE_IC_1_ADDR               0xF243
#define REG_SDATA_3_ROUTE_IC_1_BYTE               2
#define REG_SDATA_3_ROUTE_IC_1_VALUE              0x0

/* SDATA_4_ROUTE  - Registers (IC 1) */
#define REG_SDATA_4_ROUTE_IC_1_ADDR               0xF244
#define REG_SDATA_4_ROUTE_IC_1_BYTE               2
#define REG_SDATA_4_ROUTE_IC_1_VALUE              0x0

/* SDATA_5_ROUTE  - Registers (IC 1) */
#define REG_SDATA_5_ROUTE_IC_1_ADDR               0xF245
#define REG_SDATA_5_ROUTE_IC_1_BYTE               2
#define REG_SDATA_5_ROUTE_IC_1_VALUE              0x30

/* SDATA_6_ROUTE  - Registers (IC 1) */
#define REG_SDATA_6_ROUTE_IC_1_ADDR               0xF246
#define REG_SDATA_6_ROUTE_IC_1_BYTE               2
#define REG_SDATA_6_ROUTE_IC_1_VALUE              0x31

/* SDATA_7_ROUTE  - Registers (IC 1) */
#define REG_SDATA_7_ROUTE_IC_1_ADDR               0xF247
#define REG_SDATA_7_ROUTE_IC_1_BYTE               2
#define REG_SDATA_7_ROUTE_IC_1_VALUE              0x22

/* FTDM_IN0  - Registers (IC 1) */
#define REG_FTDM_IN0_IC_1_ADDR                    0xF300
#define REG_FTDM_IN0_IC_1_BYTE                    2
#define REG_FTDM_IN0_IC_1_VALUE                   0x0

/* FTDM_IN1  - Registers (IC 1) */
#define REG_FTDM_IN1_IC_1_ADDR                    0xF301
#define REG_FTDM_IN1_IC_1_BYTE                    2
#define REG_FTDM_IN1_IC_1_VALUE                   0x0

/* FTDM_IN2  - Registers (IC 1) */
#define REG_FTDM_IN2_IC_1_ADDR                    0xF302
#define REG_FTDM_IN2_IC_1_BYTE                    2
#define REG_FTDM_IN2_IC_1_VALUE                   0x0

/* FTDM_IN3  - Registers (IC 1) */
#define REG_FTDM_IN3_IC_1_ADDR                    0xF303
#define REG_FTDM_IN3_IC_1_BYTE                    2
#define REG_FTDM_IN3_IC_1_VALUE                   0x0

/* FTDM_IN4  - Registers (IC 1) */
#define REG_FTDM_IN4_IC_1_ADDR                    0xF304
#define REG_FTDM_IN4_IC_1_BYTE                    2
#define REG_FTDM_IN4_IC_1_VALUE                   0x0

