nguyenhoabinhworkplace/ESP32_sigmastudio_control/teensy_sigmadsp_example_project_1.1.0/src/SigmaStudioFiles/Simple_SS_Project_145x_146x_INDIRECT_ACCESS_TABLE_IC_1_REG.h
/* FTDM_IN5  - Registers (IC 1) */
#define REG_FTDM_IN5_IC_1_ADDR                    0xF305
#define REG_FTDM_IN5_IC_1_BYTE                    2
#define REG_FTDM_IN5_IC_1_VALUE                   0x0

/* FTDM_IN6  - Registers (IC 1) */
#define REG_FTDM_IN6_IC_1_ADDR                    0xF306
#define REG_FTDM_IN6_IC_1_BYTE                    2
#define REG_FTDM_IN6_IC_1_VALUE                   0x0

/* FTDM_IN7  - Registers (IC 1) */
#define REG_FTDM_IN7_IC_1_ADDR                    0xF307
#define REG_FTDM_IN7_IC_1_BYTE                    2
#define REG_FTDM_IN7_IC_1_VALUE                   0x0

/* FTDM_IN8  - Registers (IC 1) */
#define REG_FTDM_IN8_IC_1_ADDR                    0xF308
#define REG_FTDM_IN8_IC_1_BYTE                    2
#define REG_FTDM_IN8_IC_1_VALUE                   0x0

/* FTDM_IN9  - Registers (IC 1) */
#define REG_FTDM_IN9_IC_1_ADDR                    0xF309
#define REG_FTDM_IN9_IC_1_BYTE                    2
#define REG_FTDM_IN9_IC_1_VALUE                   0x0

/* FTDM_IN10  - Registers (IC 1) */
#define REG_FTDM_IN10_IC_1_ADDR                   0xF30A
#define REG_FTDM_IN10_IC_1_BYTE                   2
#define REG_FTDM_IN10_IC_1_VALUE                  0x0

/* FTDM_IN11  - Registers (IC 1) */
#define REG_FTDM_IN11_IC_1_ADDR                   0xF30B
#define REG_FTDM_IN11_IC_1_BYTE                   2
#define REG_FTDM_IN11_IC_1_VALUE                  0x0

/* FTDM_IN12  - Registers (IC 1) */
#define REG_FTDM_IN12_IC_1_ADDR                   0xF30C
#define REG_FTDM_IN12_IC_1_BYTE                   2
#define REG_FTDM_IN12_IC_1_VALUE                  0x0

/* FTDM_IN13  - Registers (IC 1) */
#define REG_FTDM_IN13_IC_1_ADDR                   0xF30D
#define REG_FTDM_IN13_IC_1_BYTE                   2
#define REG_FTDM_IN13_IC_1_VALUE                  0x0

/* FTDM_IN14  - Registers (IC 1) */
#define REG_FTDM_IN14_IC_1_ADDR                   0xF30E
#define REG_FTDM_IN14_IC_1_BYTE                   2
#define REG_FTDM_IN14_IC_1_VALUE                  0x0

/* FTDM_IN15  - Registers (IC 1) */
#define REG_FTDM_IN15_IC_1_ADDR                   0xF30F
#define REG_FTDM_IN15_IC_1_BYTE                   2
#define REG_FTDM_IN15_IC_1_VALUE                  0x0

/* FTDM_IN16  - Registers (IC 1) */
#define REG_FTDM_IN16_IC_1_ADDR                   0xF310
#define REG_FTDM_IN16_IC_1_BYTE                   2
#define REG_FTDM_IN16_IC_1_VALUE                  0x0

/* FTDM_IN17  - Registers (IC 1) */
#define REG_FTDM_IN17_IC_1_ADDR                   0xF311
#define REG_FTDM_IN17_IC_1_BYTE                   2
#define REG_FTDM_IN17_IC_1_VALUE                  0x0

/* FTDM_IN18  - Registers (IC 1) */
#define REG_FTDM_IN18_IC_1_ADDR                   0xF312
#define REG_FTDM_IN18_IC_1_BYTE                   2
#define REG_FTDM_IN18_IC_1_VALUE                  0x0

/* FTDM_IN19  - Registers (IC 1) */
#define REG_FTDM_IN19_IC_1_ADDR                   0xF313
#define REG_FTDM_IN19_IC_1_BYTE                   2
#define REG_FTDM_IN19_IC_1_VALUE                  0x0

/* FTDM_IN20  - Registers (IC 1) */
#define REG_FTDM_IN20_IC_1_ADDR                   0xF314
#define REG_FTDM_IN20_IC_1_BYTE                   2
#define REG_FTDM_IN20_IC_1_VALUE                  0x0

/* FTDM_IN21  - Registers (IC 1) */
#define REG_FTDM_IN21_IC_1_ADDR                   0xF315
#define REG_FTDM_IN21_IC_1_BYTE                   2
#define REG_FTDM_IN21_IC_1_VALUE                  0x0

/* FTDM_IN22  - Registers (IC 1) */
#define REG_FTDM_IN22_IC_1_ADDR                   0xF316
#define REG_FTDM_IN22_IC_1_BYTE                   2
#define REG_FTDM_IN22_IC_1_VALUE                  0x0

/* FTDM_IN23  - Registers (IC 1) */
#define REG_FTDM_IN23_IC_1_ADDR                   0xF317
#define REG_FTDM_IN23_IC_1_BYTE                   2
#define REG_FTDM_IN23_IC_1_VALUE                  0x0

/* FTDM_IN24  - Registers (IC 1) */
#define REG_FTDM_IN24_IC_1_ADDR                   0xF318
#define REG_FTDM_IN24_IC_1_BYTE                   2
#define REG_FTDM_IN24_IC_1_VALUE                  0x0

/* FTDM_IN25  - Registers (IC 1) */
#define REG_FTDM_IN25_IC_1_ADDR                   0xF319
#define REG_FTDM_IN25_IC_1_BYTE                   2
#define REG_FTDM_IN25_IC_1_VALUE                  0x0

/* FTDM_IN26  - Registers (IC 1) */
#define REG_FTDM_IN26_IC_1_ADDR                   0xF31A
#define REG_FTDM_IN26_IC_1_BYTE                   2
#define REG_FTDM_IN26_IC_1_VALUE                  0x0

/* FTDM_IN27  - Registers (IC 1) */
#define REG_FTDM_IN27_IC_1_ADDR                   0xF31B
#define REG_FTDM_IN27_IC_1_BYTE                   2
#define REG_FTDM_IN27_IC_1_VALUE                  0x0

/* FTDM_IN28  - Registers (IC 1) */
#define REG_FTDM_IN28_IC_1_ADDR                   0xF31C
#define REG_FTDM_IN28_IC_1_BYTE                   2
#define REG_FTDM_IN28_IC_1_VALUE                  0x0

/* FTDM_IN29  - Registers (IC 1) */
#define REG_FTDM_IN29_IC_1_ADDR                   0xF31D
#define REG_FTDM_IN29_IC_1_BYTE                   2
#define REG_FTDM_IN29_IC_1_VALUE                  0x0

/* FTDM_IN30  - Registers (IC 1) */
#define REG_FTDM_IN30_IC_1_ADDR                   0xF31E
#define REG_FTDM_IN30_IC_1_BYTE                   2
#define REG_FTDM_IN30_IC_1_VALUE                  0x0

/* FTDM_IN31  - Registers (IC 1) */
#define REG_FTDM_IN31_IC_1_ADDR                   0xF31F
#define REG_FTDM_IN31_IC_1_BYTE                   2
#define REG_FTDM_IN31_IC_1_VALUE                  0x0

/* FTDM_IN32  - Registers (IC 1) */
#define REG_FTDM_IN32_IC_1_ADDR                   0xF320
#define REG_FTDM_IN32_IC_1_BYTE                   2
#define REG_FTDM_IN32_IC_1_VALUE                  0x0

/* FTDM_IN33  - Registers (IC 1) */
#define REG_FTDM_IN33_IC_1_ADDR                   0xF321
#define REG_FTDM_IN33_IC_1_BYTE                   2
#define REG_FTDM_IN33_IC_1_VALUE                  0x0

/* FTDM_IN34  - Registers (IC 1) */
#define REG_FTDM_IN34_IC_1_ADDR                   0xF322
#define REG_FTDM_IN34_IC_1_BYTE                   2
#define REG_FTDM_IN34_IC_1_VALUE                  0x0

