nguyenhoabinhworkplace/ESP32_sigmastudio_control/teensy_sigmadsp_example_project_1.1.0/src/SigmaStudioFiles/Simple_SS_Project_145x_146x_INDIRECT_ACCESS_TABLE_IC_1_REG.h
/* FTDM_OUT8  - Registers (IC 1) */
#define REG_FTDM_OUT8_IC_1_ADDR                   0xF388
#define REG_FTDM_OUT8_IC_1_BYTE                   2
#define REG_FTDM_OUT8_IC_1_VALUE                  0x0

/* FTDM_OUT9  - Registers (IC 1) */
#define REG_FTDM_OUT9_IC_1_ADDR                   0xF389
#define REG_FTDM_OUT9_IC_1_BYTE                   2
#define REG_FTDM_OUT9_IC_1_VALUE                  0x0

/* FTDM_OUT10  - Registers (IC 1) */
#define REG_FTDM_OUT10_IC_1_ADDR                  0xF38A
#define REG_FTDM_OUT10_IC_1_BYTE                  2
#define REG_FTDM_OUT10_IC_1_VALUE                 0x0

/* FTDM_OUT11  - Registers (IC 1) */
#define REG_FTDM_OUT11_IC_1_ADDR                  0xF38B
#define REG_FTDM_OUT11_IC_1_BYTE                  2
#define REG_FTDM_OUT11_IC_1_VALUE                 0x0

/* FTDM_OUT12  - Registers (IC 1) */
#define REG_FTDM_OUT12_IC_1_ADDR                  0xF38C
#define REG_FTDM_OUT12_IC_1_BYTE                  2
#define REG_FTDM_OUT12_IC_1_VALUE                 0x0

/* FTDM_OUT13  - Registers (IC 1) */
#define REG_FTDM_OUT13_IC_1_ADDR                  0xF38D
#define REG_FTDM_OUT13_IC_1_BYTE                  2
#define REG_FTDM_OUT13_IC_1_VALUE                 0x0

/* FTDM_OUT14  - Registers (IC 1) */
#define REG_FTDM_OUT14_IC_1_ADDR                  0xF38E
#define REG_FTDM_OUT14_IC_1_BYTE                  2
#define REG_FTDM_OUT14_IC_1_VALUE                 0x0

/* FTDM_OUT15  - Registers (IC 1) */
#define REG_FTDM_OUT15_IC_1_ADDR                  0xF38F
#define REG_FTDM_OUT15_IC_1_BYTE                  2
#define REG_FTDM_OUT15_IC_1_VALUE                 0x0

/* FTDM_OUT16  - Registers (IC 1) */
#define REG_FTDM_OUT16_IC_1_ADDR                  0xF390
#define REG_FTDM_OUT16_IC_1_BYTE                  2
#define REG_FTDM_OUT16_IC_1_VALUE                 0x0

/* FTDM_OUT17  - Registers (IC 1) */
#define REG_FTDM_OUT17_IC_1_ADDR                  0xF391
#define REG_FTDM_OUT17_IC_1_BYTE                  2
#define REG_FTDM_OUT17_IC_1_VALUE                 0x0

/* FTDM_OUT18  - Registers (IC 1) */
#define REG_FTDM_OUT18_IC_1_ADDR                  0xF392
#define REG_FTDM_OUT18_IC_1_BYTE                  2
#define REG_FTDM_OUT18_IC_1_VALUE                 0x0

/* FTDM_OUT19  - Registers (IC 1) */
#define REG_FTDM_OUT19_IC_1_ADDR                  0xF393
#define REG_FTDM_OUT19_IC_1_BYTE                  2
#define REG_FTDM_OUT19_IC_1_VALUE                 0x0

/* FTDM_OUT20  - Registers (IC 1) */
#define REG_FTDM_OUT20_IC_1_ADDR                  0xF394
#define REG_FTDM_OUT20_IC_1_BYTE                  2
#define REG_FTDM_OUT20_IC_1_VALUE                 0x0

/* FTDM_OUT21  - Registers (IC 1) */
#define REG_FTDM_OUT21_IC_1_ADDR                  0xF395
#define REG_FTDM_OUT21_IC_1_BYTE                  2
#define REG_FTDM_OUT21_IC_1_VALUE                 0x0

/* FTDM_OUT22  - Registers (IC 1) */
#define REG_FTDM_OUT22_IC_1_ADDR                  0xF396
#define REG_FTDM_OUT22_IC_1_BYTE                  2
#define REG_FTDM_OUT22_IC_1_VALUE                 0x0

/* FTDM_OUT23  - Registers (IC 1) */
#define REG_FTDM_OUT23_IC_1_ADDR                  0xF397
#define REG_FTDM_OUT23_IC_1_BYTE                  2
#define REG_FTDM_OUT23_IC_1_VALUE                 0x0

/* FTDM_OUT24  - Registers (IC 1) */
#define REG_FTDM_OUT24_IC_1_ADDR                  0xF398
#define REG_FTDM_OUT24_IC_1_BYTE                  2
#define REG_FTDM_OUT24_IC_1_VALUE                 0x0

/* FTDM_OUT25  - Registers (IC 1) */
#define REG_FTDM_OUT25_IC_1_ADDR                  0xF399
#define REG_FTDM_OUT25_IC_1_BYTE                  2
#define REG_FTDM_OUT25_IC_1_VALUE                 0x0

/* FTDM_OUT26  - Registers (IC 1) */
#define REG_FTDM_OUT26_IC_1_ADDR                  0xF39A
#define REG_FTDM_OUT26_IC_1_BYTE                  2
#define REG_FTDM_OUT26_IC_1_VALUE                 0x0

/* FTDM_OUT27  - Registers (IC 1) */
#define REG_FTDM_OUT27_IC_1_ADDR                  0xF39B
#define REG_FTDM_OUT27_IC_1_BYTE                  2
#define REG_FTDM_OUT27_IC_1_VALUE                 0x0

/* FTDM_OUT28  - Registers (IC 1) */
#define REG_FTDM_OUT28_IC_1_ADDR                  0xF39C
#define REG_FTDM_OUT28_IC_1_BYTE                  2
#define REG_FTDM_OUT28_IC_1_VALUE                 0x0

/* FTDM_OUT29  - Registers (IC 1) */
#define REG_FTDM_OUT29_IC_1_ADDR                  0xF39D
#define REG_FTDM_OUT29_IC_1_BYTE                  2
#define REG_FTDM_OUT29_IC_1_VALUE                 0x0

/* FTDM_OUT30  - Registers (IC 1) */
#define REG_FTDM_OUT30_IC_1_ADDR                  0xF39E
#define REG_FTDM_OUT30_IC_1_BYTE                  2
#define REG_FTDM_OUT30_IC_1_VALUE                 0x0

/* FTDM_OUT31  - Registers (IC 1) */
#define REG_FTDM_OUT31_IC_1_ADDR                  0xF39F
#define REG_FTDM_OUT31_IC_1_BYTE                  2
#define REG_FTDM_OUT31_IC_1_VALUE                 0x0

/* FTDM_OUT32  - Registers (IC 1) */
#define REG_FTDM_OUT32_IC_1_ADDR                  0xF3A0
#define REG_FTDM_OUT32_IC_1_BYTE                  2
#define REG_FTDM_OUT32_IC_1_VALUE                 0x0

/* FTDM_OUT33  - Registers (IC 1) */
#define REG_FTDM_OUT33_IC_1_ADDR                  0xF3A1
#define REG_FTDM_OUT33_IC_1_BYTE                  2
#define REG_FTDM_OUT33_IC_1_VALUE                 0x0

/* FTDM_OUT34  - Registers (IC 1) */
#define REG_FTDM_OUT34_IC_1_ADDR                  0xF3A2
#define REG_FTDM_OUT34_IC_1_BYTE                  2
#define REG_FTDM_OUT34_IC_1_VALUE                 0x0

/* FTDM_OUT35  - Registers (IC 1) */
#define REG_FTDM_OUT35_IC_1_ADDR                  0xF3A3
#define REG_FTDM_OUT35_IC_1_BYTE                  2
#define REG_FTDM_OUT35_IC_1_VALUE                 0x0

/* FTDM_OUT36  - Registers (IC 1) */
#define REG_FTDM_OUT36_IC_1_ADDR                  0xF3A4
#define REG_FTDM_OUT36_IC_1_BYTE                  2
#define REG_FTDM_OUT36_IC_1_VALUE                 0x0

/* FTDM_OUT37  - Registers (IC 1) */
#define REG_FTDM_OUT37_IC_1_ADDR                  0xF3A5
#define REG_FTDM_OUT37_IC_1_BYTE                  2
#define REG_FTDM_OUT37_IC_1_VALUE                 0x0

/* FTDM_OUT38  - Registers (IC 1) */
#define REG_FTDM_OUT38_IC_1_ADDR                  0xF3A6
#define REG_FTDM_OUT38_IC_1_BYTE                  2
#define REG_FTDM_OUT38_IC_1_VALUE                 0x0

/* FTDM_OUT39  - Registers (IC 1) */
#define REG_FTDM_OUT39_IC_1_ADDR                  0xF3A7
#define REG_FTDM_OUT39_IC_1_BYTE                  2
#define REG_FTDM_OUT39_IC_1_VALUE                 0x0

/* FTDM_OUT40  - Registers (IC 1) */
#define REG_FTDM_OUT40_IC_1_ADDR                  0xF3A8
#define REG_FTDM_OUT40_IC_1_BYTE                  2
#define REG_FTDM_OUT40_IC_1_VALUE                 0x0

