nguyenhoabinhworkplace/ESP32_sigmastudio_control/teensy_sigmadsp_example_project_1.1.0/src/SigmaStudioFiles/Simple_SS_Project_145x_146x_INDIRECT_ACCESS_TABLE_IC_1_REG.h
/* SOUT_SOURCE14 (IC 1) */
#define R47_SOUT_SOURCE14_SOUT_SOURCE_IC_1        0x2    /* 010b	[2:0] */
#define R47_SOUT_SOURCE14_SOUT_ASRC_SELECT_IC_1   0x0    /* 000b	[5:3] */
#define R47_SOUT_SOURCE14_SOUT_SOURCE_IC_1_MASK   0x7
#define R47_SOUT_SOURCE14_SOUT_SOURCE_IC_1_SHIFT  0
#define R47_SOUT_SOURCE14_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R47_SOUT_SOURCE14_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE15 (IC 1) */
#define R48_SOUT_SOURCE15_SOUT_SOURCE_IC_1        0x2    /* 010b	[2:0] */
#define R48_SOUT_SOURCE15_SOUT_ASRC_SELECT_IC_1   0x0    /* 000b	[5:3] */
#define R48_SOUT_SOURCE15_SOUT_SOURCE_IC_1_MASK   0x7
#define R48_SOUT_SOURCE15_SOUT_SOURCE_IC_1_SHIFT  0
#define R48_SOUT_SOURCE15_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R48_SOUT_SOURCE15_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE16 (IC 1) */
#define R49_SOUT_SOURCE16_SOUT_SOURCE_IC_1        0x2    /* 010b	[2:0] */
#define R49_SOUT_SOURCE16_SOUT_ASRC_SELECT_IC_1   0x0    /* 000b	[5:3] */
#define R49_SOUT_SOURCE16_SOUT_SOURCE_IC_1_MASK   0x7
#define R49_SOUT_SOURCE16_SOUT_SOURCE_IC_1_SHIFT  0
#define R49_SOUT_SOURCE16_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R49_SOUT_SOURCE16_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE17 (IC 1) */
#define R50_SOUT_SOURCE17_SOUT_SOURCE_IC_1        0x2    /* 010b	[2:0] */
#define R50_SOUT_SOURCE17_SOUT_ASRC_SELECT_IC_1   0x0    /* 000b	[5:3] */
#define R50_SOUT_SOURCE17_SOUT_SOURCE_IC_1_MASK   0x7
#define R50_SOUT_SOURCE17_SOUT_SOURCE_IC_1_SHIFT  0
#define R50_SOUT_SOURCE17_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R50_SOUT_SOURCE17_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE18 (IC 1) */
#define R51_SOUT_SOURCE18_SOUT_SOURCE_IC_1        0x2    /* 010b	[2:0] */
#define R51_SOUT_SOURCE18_SOUT_ASRC_SELECT_IC_1   0x0    /* 000b	[5:3] */
#define R51_SOUT_SOURCE18_SOUT_SOURCE_IC_1_MASK   0x7
#define R51_SOUT_SOURCE18_SOUT_SOURCE_IC_1_SHIFT  0
#define R51_SOUT_SOURCE18_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R51_SOUT_SOURCE18_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE19 (IC 1) */
#define R52_SOUT_SOURCE19_SOUT_SOURCE_IC_1        0x2    /* 010b	[2:0] */
#define R52_SOUT_SOURCE19_SOUT_ASRC_SELECT_IC_1   0x0    /* 000b	[5:3] */
#define R52_SOUT_SOURCE19_SOUT_SOURCE_IC_1_MASK   0x7
#define R52_SOUT_SOURCE19_SOUT_SOURCE_IC_1_SHIFT  0
#define R52_SOUT_SOURCE19_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R52_SOUT_SOURCE19_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE20 (IC 1) */
#define R53_SOUT_SOURCE20_SOUT_SOURCE_IC_1        0x2    /* 010b	[2:0] */
#define R53_SOUT_SOURCE20_SOUT_ASRC_SELECT_IC_1   0x0    /* 000b	[5:3] */
#define R53_SOUT_SOURCE20_SOUT_SOURCE_IC_1_MASK   0x7
#define R53_SOUT_SOURCE20_SOUT_SOURCE_IC_1_SHIFT  0
#define R53_SOUT_SOURCE20_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R53_SOUT_SOURCE20_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE21 (IC 1) */
#define R54_SOUT_SOURCE21_SOUT_SOURCE_IC_1        0x2    /* 010b	[2:0] */
#define R54_SOUT_SOURCE21_SOUT_ASRC_SELECT_IC_1   0x0    /* 000b	[5:3] */
#define R54_SOUT_SOURCE21_SOUT_SOURCE_IC_1_MASK   0x7
#define R54_SOUT_SOURCE21_SOUT_SOURCE_IC_1_SHIFT  0
#define R54_SOUT_SOURCE21_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R54_SOUT_SOURCE21_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE22 (IC 1) */
#define R55_SOUT_SOURCE22_SOUT_SOURCE_IC_1        0x2    /* 010b	[2:0] */
#define R55_SOUT_SOURCE22_SOUT_ASRC_SELECT_IC_1   0x0    /* 000b	[5:3] */
#define R55_SOUT_SOURCE22_SOUT_SOURCE_IC_1_MASK   0x7
#define R55_SOUT_SOURCE22_SOUT_SOURCE_IC_1_SHIFT  0
#define R55_SOUT_SOURCE22_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R55_SOUT_SOURCE22_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE23 (IC 1) */
#define R56_SOUT_SOURCE23_SOUT_SOURCE_IC_1        0x2    /* 010b	[2:0] */
#define R56_SOUT_SOURCE23_SOUT_ASRC_SELECT_IC_1   0x0    /* 000b	[5:3] */
#define R56_SOUT_SOURCE23_SOUT_SOURCE_IC_1_MASK   0x7
#define R56_SOUT_SOURCE23_SOUT_SOURCE_IC_1_SHIFT  0
#define R56_SOUT_SOURCE23_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R56_SOUT_SOURCE23_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SPDIFTX_INPUT (IC 1) */
#define R57_SPDIFTX_INPUT_SPDIFTX_SOURCE_IC_1     0x0    /* 00b	[1:0] */
#define R57_SPDIFTX_INPUT_SPDIFTX_SOURCE_IC_1_MASK 0x3
#define R57_SPDIFTX_INPUT_SPDIFTX_SOURCE_IC_1_SHIFT 0

/* SERIAL_BYTE_0_0 (IC 1) */
#define R58_SERIAL_BYTE_0_0_TDM_MODE_IC_1         0x0    /* 000b	[2:0] */
#define R58_SERIAL_BYTE_0_0_DATA_FMT_IC_1         0x0    /* 00b	[4:3] */
#define R58_SERIAL_BYTE_0_0_WORD_LEN_IC_1         0x0    /* 00b	[6:5] */
#define R58_SERIAL_BYTE_0_0_BCLK_POL_IC_1         0x0    /* 0b	[7] */
#define R58_SERIAL_BYTE_0_0_LRCLK_POL_IC_1        0x0    /* 0b	[8] */
#define R58_SERIAL_BYTE_0_0_LRCLK_MODE_IC_1       0x0    /* 0b	[9] */
#define R58_SERIAL_BYTE_0_0_BCLK_SRC_IC_1         0x4    /* 100b	[12:10] */
#define R58_SERIAL_BYTE_0_0_LRCLK_SRC_IC_1        0x4    /* 100b	[15:13] */
#define R58_SERIAL_BYTE_0_0_TDM_MODE_IC_1_MASK    0x7
#define R58_SERIAL_BYTE_0_0_TDM_MODE_IC_1_SHIFT   0
#define R58_SERIAL_BYTE_0_0_DATA_FMT_IC_1_MASK    0x18
#define R58_SERIAL_BYTE_0_0_DATA_FMT_IC_1_SHIFT   3
#define R58_SERIAL_BYTE_0_0_WORD_LEN_IC_1_MASK    0x60
#define R58_SERIAL_BYTE_0_0_WORD_LEN_IC_1_SHIFT   5
#define R58_SERIAL_BYTE_0_0_BCLK_POL_IC_1_MASK    0x80
#define R58_SERIAL_BYTE_0_0_BCLK_POL_IC_1_SHIFT   7
#define R58_SERIAL_BYTE_0_0_LRCLK_POL_IC_1_MASK   0x100
#define R58_SERIAL_BYTE_0_0_LRCLK_POL_IC_1_SHIFT  8
#define R58_SERIAL_BYTE_0_0_LRCLK_MODE_IC_1_MASK  0x200
#define R58_SERIAL_BYTE_0_0_LRCLK_MODE_IC_1_SHIFT 9
#define R58_SERIAL_BYTE_0_0_BCLK_SRC_IC_1_MASK    0x1C00
#define R58_SERIAL_BYTE_0_0_BCLK_SRC_IC_1_SHIFT   10
#define R58_SERIAL_BYTE_0_0_LRCLK_SRC_IC_1_MASK   0xE000
#define R58_SERIAL_BYTE_0_0_LRCLK_SRC_IC_1_SHIFT  13

/* SERIAL_BYTE_0_1 (IC 1) */
#define R59_SERIAL_BYTE_0_1_FS_IC_1               0x2    /* 010b	[2:0] */
#define R59_SERIAL_BYTE_0_1_CLK_DOMAIN_IC_1       0x0    /* 00b	[4:3] */
#define R59_SERIAL_BYTE_0_1_TRISTATE_IC_1         0x0    /* 0b	[5] */
#define R59_SERIAL_BYTE_0_1_FS_IC_1_MASK          0x7
#define R59_SERIAL_BYTE_0_1_FS_IC_1_SHIFT         0
#define R59_SERIAL_BYTE_0_1_CLK_DOMAIN_IC_1_MASK  0x18
#define R59_SERIAL_BYTE_0_1_CLK_DOMAIN_IC_1_SHIFT 3
#define R59_SERIAL_BYTE_0_1_TRISTATE_IC_1_MASK    0x20
#define R59_SERIAL_BYTE_0_1_TRISTATE_IC_1_SHIFT   5

/* SERIAL_BYTE_1_0 (IC 1) */
#define R60_SERIAL_BYTE_1_0_TDM_MODE_IC_1         0x0    /* 000b	[2:0] */
#define R60_SERIAL_BYTE_1_0_DATA_FMT_IC_1         0x0    /* 00b	[4:3] */
#define R60_SERIAL_BYTE_1_0_WORD_LEN_IC_1         0x0    /* 00b	[6:5] */
#define R60_SERIAL_BYTE_1_0_BCLK_POL_IC_1         0x0    /* 0b	[7] */
#define R60_SERIAL_BYTE_1_0_LRCLK_POL_IC_1        0x0    /* 0b	[8] */
#define R60_SERIAL_BYTE_1_0_LRCLK_MODE_IC_1       0x0    /* 0b	[9] */
#define R60_SERIAL_BYTE_1_0_BCLK_SRC_IC_1         0x4    /* 100b	[12:10] */
#define R60_SERIAL_BYTE_1_0_LRCLK_SRC_IC_1        0x4    /* 100b	[15:13] */
#define R60_SERIAL_BYTE_1_0_TDM_MODE_IC_1_MASK    0x7
#define R60_SERIAL_BYTE_1_0_TDM_MODE_IC_1_SHIFT   0
#define R60_SERIAL_BYTE_1_0_DATA_FMT_IC_1_MASK    0x18
#define R60_SERIAL_BYTE_1_0_DATA_FMT_IC_1_SHIFT   3
#define R60_SERIAL_BYTE_1_0_WORD_LEN_IC_1_MASK    0x60
#define R60_SERIAL_BYTE_1_0_WORD_LEN_IC_1_SHIFT   5
#define R60_SERIAL_BYTE_1_0_BCLK_POL_IC_1_MASK    0x80
#define R60_SERIAL_BYTE_1_0_BCLK_POL_IC_1_SHIFT   7
#define R60_SERIAL_BYTE_1_0_LRCLK_POL_IC_1_MASK   0x100
#define R60_SERIAL_BYTE_1_0_LRCLK_POL_IC_1_SHIFT  8
#define R60_SERIAL_BYTE_1_0_LRCLK_MODE_IC_1_MASK  0x200
#define R60_SERIAL_BYTE_1_0_LRCLK_MODE_IC_1_SHIFT 9
#define R60_SERIAL_BYTE_1_0_BCLK_SRC_IC_1_MASK    0x1C00
#define R60_SERIAL_BYTE_1_0_BCLK_SRC_IC_1_SHIFT   10
#define R60_SERIAL_BYTE_1_0_LRCLK_SRC_IC_1_MASK   0xE000
#define R60_SERIAL_BYTE_1_0_LRCLK_SRC_IC_1_SHIFT  13

/* SERIAL_BYTE_1_1 (IC 1) */
#define R61_SERIAL_BYTE_1_1_FS_IC_1               0x2    /* 010b	[2:0] */
#define R61_SERIAL_BYTE_1_1_CLK_DOMAIN_IC_1       0x0    /* 00b	[4:3] */
#define R61_SERIAL_BYTE_1_1_TRISTATE_IC_1         0x0    /* 0b	[5] */
#define R61_SERIAL_BYTE_1_1_FS_IC_1_MASK          0x7
#define R61_SERIAL_BYTE_1_1_FS_IC_1_SHIFT         0
#define R61_SERIAL_BYTE_1_1_CLK_DOMAIN_IC_1_MASK  0x18
#define R61_SERIAL_BYTE_1_1_CLK_DOMAIN_IC_1_SHIFT 3
#define R61_SERIAL_BYTE_1_1_TRISTATE_IC_1_MASK    0x20
#define R61_SERIAL_BYTE_1_1_TRISTATE_IC_1_SHIFT   5

