nguyenhoabinhworkplace/ESP32_sigmastudio_control/teensy_sigmadsp_example_project_1.1.0/src/SigmaStudioFiles/Simple_SS_Project_145x_146x_INDIRECT_ACCESS_TABLE_IC_1_REG.h
/* SERIAL_BYTE_2_0 (IC 1) */
#define R62_SERIAL_BYTE_2_0_TDM_MODE_IC_1         0x0    /* 000b	[2:0] */
#define R62_SERIAL_BYTE_2_0_DATA_FMT_IC_1         0x0    /* 00b	[4:3] */
#define R62_SERIAL_BYTE_2_0_WORD_LEN_IC_1         0x0    /* 00b	[6:5] */
#define R62_SERIAL_BYTE_2_0_BCLK_POL_IC_1         0x0    /* 0b	[7] */
#define R62_SERIAL_BYTE_2_0_LRCLK_POL_IC_1        0x0    /* 0b	[8] */
#define R62_SERIAL_BYTE_2_0_LRCLK_MODE_IC_1       0x0    /* 0b	[9] */
#define R62_SERIAL_BYTE_2_0_BCLK_SRC_IC_1         0x4    /* 100b	[12:10] */
#define R62_SERIAL_BYTE_2_0_LRCLK_SRC_IC_1        0x4    /* 100b	[15:13] */
#define R62_SERIAL_BYTE_2_0_TDM_MODE_IC_1_MASK    0x7
#define R62_SERIAL_BYTE_2_0_TDM_MODE_IC_1_SHIFT   0
#define R62_SERIAL_BYTE_2_0_DATA_FMT_IC_1_MASK    0x18
#define R62_SERIAL_BYTE_2_0_DATA_FMT_IC_1_SHIFT   3
#define R62_SERIAL_BYTE_2_0_WORD_LEN_IC_1_MASK    0x60
#define R62_SERIAL_BYTE_2_0_WORD_LEN_IC_1_SHIFT   5
#define R62_SERIAL_BYTE_2_0_BCLK_POL_IC_1_MASK    0x80
#define R62_SERIAL_BYTE_2_0_BCLK_POL_IC_1_SHIFT   7
#define R62_SERIAL_BYTE_2_0_LRCLK_POL_IC_1_MASK   0x100
#define R62_SERIAL_BYTE_2_0_LRCLK_POL_IC_1_SHIFT  8
#define R62_SERIAL_BYTE_2_0_LRCLK_MODE_IC_1_MASK  0x200
#define R62_SERIAL_BYTE_2_0_LRCLK_MODE_IC_1_SHIFT 9
#define R62_SERIAL_BYTE_2_0_BCLK_SRC_IC_1_MASK    0x1C00
#define R62_SERIAL_BYTE_2_0_BCLK_SRC_IC_1_SHIFT   10
#define R62_SERIAL_BYTE_2_0_LRCLK_SRC_IC_1_MASK   0xE000
#define R62_SERIAL_BYTE_2_0_LRCLK_SRC_IC_1_SHIFT  13

/* SERIAL_BYTE_2_1 (IC 1) */
#define R63_SERIAL_BYTE_2_1_FS_IC_1               0x2    /* 010b	[2:0] */
#define R63_SERIAL_BYTE_2_1_CLK_DOMAIN_IC_1       0x0    /* 00b	[4:3] */
#define R63_SERIAL_BYTE_2_1_TRISTATE_IC_1         0x0    /* 0b	[5] */
#define R63_SERIAL_BYTE_2_1_FS_IC_1_MASK          0x7
#define R63_SERIAL_BYTE_2_1_FS_IC_1_SHIFT         0
#define R63_SERIAL_BYTE_2_1_CLK_DOMAIN_IC_1_MASK  0x18
#define R63_SERIAL_BYTE_2_1_CLK_DOMAIN_IC_1_SHIFT 3
#define R63_SERIAL_BYTE_2_1_TRISTATE_IC_1_MASK    0x20
#define R63_SERIAL_BYTE_2_1_TRISTATE_IC_1_SHIFT   5

/* SERIAL_BYTE_3_0 (IC 1) */
#define R64_SERIAL_BYTE_3_0_TDM_MODE_IC_1         0x0    /* 000b	[2:0] */
#define R64_SERIAL_BYTE_3_0_DATA_FMT_IC_1         0x0    /* 00b	[4:3] */
#define R64_SERIAL_BYTE_3_0_WORD_LEN_IC_1         0x0    /* 00b	[6:5] */
#define R64_SERIAL_BYTE_3_0_BCLK_POL_IC_1         0x0    /* 0b	[7] */
#define R64_SERIAL_BYTE_3_0_LRCLK_POL_IC_1        0x0    /* 0b	[8] */
#define R64_SERIAL_BYTE_3_0_LRCLK_MODE_IC_1       0x0    /* 0b	[9] */
#define R64_SERIAL_BYTE_3_0_BCLK_SRC_IC_1         0x3    /* 011b	[12:10] */
#define R64_SERIAL_BYTE_3_0_LRCLK_SRC_IC_1        0x3    /* 011b	[15:13] */
#define R64_SERIAL_BYTE_3_0_TDM_MODE_IC_1_MASK    0x7
#define R64_SERIAL_BYTE_3_0_TDM_MODE_IC_1_SHIFT   0
#define R64_SERIAL_BYTE_3_0_DATA_FMT_IC_1_MASK    0x18
#define R64_SERIAL_BYTE_3_0_DATA_FMT_IC_1_SHIFT   3
#define R64_SERIAL_BYTE_3_0_WORD_LEN_IC_1_MASK    0x60
#define R64_SERIAL_BYTE_3_0_WORD_LEN_IC_1_SHIFT   5
#define R64_SERIAL_BYTE_3_0_BCLK_POL_IC_1_MASK    0x80
#define R64_SERIAL_BYTE_3_0_BCLK_POL_IC_1_SHIFT   7
#define R64_SERIAL_BYTE_3_0_LRCLK_POL_IC_1_MASK   0x100
#define R64_SERIAL_BYTE_3_0_LRCLK_POL_IC_1_SHIFT  8
#define R64_SERIAL_BYTE_3_0_LRCLK_MODE_IC_1_MASK  0x200
#define R64_SERIAL_BYTE_3_0_LRCLK_MODE_IC_1_SHIFT 9
#define R64_SERIAL_BYTE_3_0_BCLK_SRC_IC_1_MASK    0x1C00
#define R64_SERIAL_BYTE_3_0_BCLK_SRC_IC_1_SHIFT   10
#define R64_SERIAL_BYTE_3_0_LRCLK_SRC_IC_1_MASK   0xE000
#define R64_SERIAL_BYTE_3_0_LRCLK_SRC_IC_1_SHIFT  13

/* SERIAL_BYTE_3_1 (IC 1) */
#define R65_SERIAL_BYTE_3_1_FS_IC_1               0x2    /* 010b	[2:0] */
#define R65_SERIAL_BYTE_3_1_CLK_DOMAIN_IC_1       0x0    /* 00b	[4:3] */
#define R65_SERIAL_BYTE_3_1_TRISTATE_IC_1         0x0    /* 0b	[5] */
#define R65_SERIAL_BYTE_3_1_FS_IC_1_MASK          0x7
#define R65_SERIAL_BYTE_3_1_FS_IC_1_SHIFT         0
#define R65_SERIAL_BYTE_3_1_CLK_DOMAIN_IC_1_MASK  0x18
#define R65_SERIAL_BYTE_3_1_CLK_DOMAIN_IC_1_SHIFT 3
#define R65_SERIAL_BYTE_3_1_TRISTATE_IC_1_MASK    0x20
#define R65_SERIAL_BYTE_3_1_TRISTATE_IC_1_SHIFT   5

/* SERIAL_BYTE_4_0 (IC 1) */
#define R66_SERIAL_BYTE_4_0_TDM_MODE_IC_1         0x0    /* 000b	[2:0] */
#define R66_SERIAL_BYTE_4_0_DATA_FMT_IC_1         0x0    /* 00b	[4:3] */
#define R66_SERIAL_BYTE_4_0_WORD_LEN_IC_1         0x0    /* 00b	[6:5] */
#define R66_SERIAL_BYTE_4_0_BCLK_POL_IC_1         0x0    /* 0b	[7] */
#define R66_SERIAL_BYTE_4_0_LRCLK_POL_IC_1        0x0    /* 0b	[8] */
#define R66_SERIAL_BYTE_4_0_LRCLK_MODE_IC_1       0x0    /* 0b	[9] */
#define R66_SERIAL_BYTE_4_0_BCLK_SRC_IC_1         0x4    /* 100b	[12:10] */
#define R66_SERIAL_BYTE_4_0_LRCLK_SRC_IC_1        0x4    /* 100b	[15:13] */
#define R66_SERIAL_BYTE_4_0_TDM_MODE_IC_1_MASK    0x7
#define R66_SERIAL_BYTE_4_0_TDM_MODE_IC_1_SHIFT   0
#define R66_SERIAL_BYTE_4_0_DATA_FMT_IC_1_MASK    0x18
#define R66_SERIAL_BYTE_4_0_DATA_FMT_IC_1_SHIFT   3
#define R66_SERIAL_BYTE_4_0_WORD_LEN_IC_1_MASK    0x60
#define R66_SERIAL_BYTE_4_0_WORD_LEN_IC_1_SHIFT   5
#define R66_SERIAL_BYTE_4_0_BCLK_POL_IC_1_MASK    0x80
#define R66_SERIAL_BYTE_4_0_BCLK_POL_IC_1_SHIFT   7
#define R66_SERIAL_BYTE_4_0_LRCLK_POL_IC_1_MASK   0x100
#define R66_SERIAL_BYTE_4_0_LRCLK_POL_IC_1_SHIFT  8
#define R66_SERIAL_BYTE_4_0_LRCLK_MODE_IC_1_MASK  0x200
#define R66_SERIAL_BYTE_4_0_LRCLK_MODE_IC_1_SHIFT 9
#define R66_SERIAL_BYTE_4_0_BCLK_SRC_IC_1_MASK    0x1C00
#define R66_SERIAL_BYTE_4_0_BCLK_SRC_IC_1_SHIFT   10
#define R66_SERIAL_BYTE_4_0_LRCLK_SRC_IC_1_MASK   0xE000
#define R66_SERIAL_BYTE_4_0_LRCLK_SRC_IC_1_SHIFT  13

/* SERIAL_BYTE_4_1 (IC 1) */
#define R67_SERIAL_BYTE_4_1_FS_IC_1               0x2    /* 010b	[2:0] */
#define R67_SERIAL_BYTE_4_1_CLK_DOMAIN_IC_1       0x0    /* 00b	[4:3] */
#define R67_SERIAL_BYTE_4_1_TRISTATE_IC_1         0x0    /* 0b	[5] */
#define R67_SERIAL_BYTE_4_1_FS_IC_1_MASK          0x7
#define R67_SERIAL_BYTE_4_1_FS_IC_1_SHIFT         0
#define R67_SERIAL_BYTE_4_1_CLK_DOMAIN_IC_1_MASK  0x18
#define R67_SERIAL_BYTE_4_1_CLK_DOMAIN_IC_1_SHIFT 3
#define R67_SERIAL_BYTE_4_1_TRISTATE_IC_1_MASK    0x20
#define R67_SERIAL_BYTE_4_1_TRISTATE_IC_1_SHIFT   5

