nguyenhoabinhworkplace/ESP32_sigmastudio_control/teensy_sigmadsp_example_project_1.1.0/src/SigmaStudioFiles/Simple_SS_Project_145x_146x_INDIRECT_ACCESS_TABLE_IC_1_REG.h
/* FTDM_OUT6 (IC 1) */
#define R152_FTDM_OUT6_BYTE_OUT_POS_IC_1          0x0    /* 00b	[1:0] */
#define R152_FTDM_OUT6_CHANNEL_OUT_POS_IC_1       0x0    /* 000b	[4:2] */
#define R152_FTDM_OUT6_SERIAL_OUT_SEL_IC_1        0x0    /* 0b	[5] */
#define R152_FTDM_OUT6_REVERSE_OUT_BYTE_IC_1      0x0    /* 0b	[6] */
#define R152_FTDM_OUT6_SLOT_ENABLE_OUT_IC_1       0x0    /* 0b	[7] */
#define R152_FTDM_OUT6_BYTE_OUT_POS_IC_1_MASK     0x3
#define R152_FTDM_OUT6_BYTE_OUT_POS_IC_1_SHIFT    0
#define R152_FTDM_OUT6_CHANNEL_OUT_POS_IC_1_MASK  0x1C
#define R152_FTDM_OUT6_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R152_FTDM_OUT6_SERIAL_OUT_SEL_IC_1_MASK   0x20
#define R152_FTDM_OUT6_SERIAL_OUT_SEL_IC_1_SHIFT  5
#define R152_FTDM_OUT6_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R152_FTDM_OUT6_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R152_FTDM_OUT6_SLOT_ENABLE_OUT_IC_1_MASK  0x80
#define R152_FTDM_OUT6_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT7 (IC 1) */
#define R153_FTDM_OUT7_BYTE_OUT_POS_IC_1          0x0    /* 00b	[1:0] */
#define R153_FTDM_OUT7_CHANNEL_OUT_POS_IC_1       0x0    /* 000b	[4:2] */
#define R153_FTDM_OUT7_SERIAL_OUT_SEL_IC_1        0x0    /* 0b	[5] */
#define R153_FTDM_OUT7_REVERSE_OUT_BYTE_IC_1      0x0    /* 0b	[6] */
#define R153_FTDM_OUT7_SLOT_ENABLE_OUT_IC_1       0x0    /* 0b	[7] */
#define R153_FTDM_OUT7_BYTE_OUT_POS_IC_1_MASK     0x3
#define R153_FTDM_OUT7_BYTE_OUT_POS_IC_1_SHIFT    0
#define R153_FTDM_OUT7_CHANNEL_OUT_POS_IC_1_MASK  0x1C
#define R153_FTDM_OUT7_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R153_FTDM_OUT7_SERIAL_OUT_SEL_IC_1_MASK   0x20
#define R153_FTDM_OUT7_SERIAL_OUT_SEL_IC_1_SHIFT  5
#define R153_FTDM_OUT7_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R153_FTDM_OUT7_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R153_FTDM_OUT7_SLOT_ENABLE_OUT_IC_1_MASK  0x80
#define R153_FTDM_OUT7_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT8 (IC 1) */
#define R154_FTDM_OUT8_BYTE_OUT_POS_IC_1          0x0    /* 00b	[1:0] */
#define R154_FTDM_OUT8_CHANNEL_OUT_POS_IC_1       0x0    /* 000b	[4:2] */
#define R154_FTDM_OUT8_SERIAL_OUT_SEL_IC_1        0x0    /* 0b	[5] */
#define R154_FTDM_OUT8_REVERSE_OUT_BYTE_IC_1      0x0    /* 0b	[6] */
#define R154_FTDM_OUT8_SLOT_ENABLE_OUT_IC_1       0x0    /* 0b	[7] */
#define R154_FTDM_OUT8_BYTE_OUT_POS_IC_1_MASK     0x3
#define R154_FTDM_OUT8_BYTE_OUT_POS_IC_1_SHIFT    0
#define R154_FTDM_OUT8_CHANNEL_OUT_POS_IC_1_MASK  0x1C
#define R154_FTDM_OUT8_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R154_FTDM_OUT8_SERIAL_OUT_SEL_IC_1_MASK   0x20
#define R154_FTDM_OUT8_SERIAL_OUT_SEL_IC_1_SHIFT  5
#define R154_FTDM_OUT8_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R154_FTDM_OUT8_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R154_FTDM_OUT8_SLOT_ENABLE_OUT_IC_1_MASK  0x80
#define R154_FTDM_OUT8_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT9 (IC 1) */
#define R155_FTDM_OUT9_BYTE_OUT_POS_IC_1          0x0    /* 00b	[1:0] */
#define R155_FTDM_OUT9_CHANNEL_OUT_POS_IC_1       0x0    /* 000b	[4:2] */
#define R155_FTDM_OUT9_SERIAL_OUT_SEL_IC_1        0x0    /* 0b	[5] */
#define R155_FTDM_OUT9_REVERSE_OUT_BYTE_IC_1      0x0    /* 0b	[6] */
#define R155_FTDM_OUT9_SLOT_ENABLE_OUT_IC_1       0x0    /* 0b	[7] */
#define R155_FTDM_OUT9_BYTE_OUT_POS_IC_1_MASK     0x3
#define R155_FTDM_OUT9_BYTE_OUT_POS_IC_1_SHIFT    0
#define R155_FTDM_OUT9_CHANNEL_OUT_POS_IC_1_MASK  0x1C
#define R155_FTDM_OUT9_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R155_FTDM_OUT9_SERIAL_OUT_SEL_IC_1_MASK   0x20
#define R155_FTDM_OUT9_SERIAL_OUT_SEL_IC_1_SHIFT  5
#define R155_FTDM_OUT9_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R155_FTDM_OUT9_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R155_FTDM_OUT9_SLOT_ENABLE_OUT_IC_1_MASK  0x80
#define R155_FTDM_OUT9_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT10 (IC 1) */
#define R156_FTDM_OUT10_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R156_FTDM_OUT10_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R156_FTDM_OUT10_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R156_FTDM_OUT10_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R156_FTDM_OUT10_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R156_FTDM_OUT10_BYTE_OUT_POS_IC_1_MASK    0x3
#define R156_FTDM_OUT10_BYTE_OUT_POS_IC_1_SHIFT   0
#define R156_FTDM_OUT10_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R156_FTDM_OUT10_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R156_FTDM_OUT10_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R156_FTDM_OUT10_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R156_FTDM_OUT10_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R156_FTDM_OUT10_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R156_FTDM_OUT10_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R156_FTDM_OUT10_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT11 (IC 1) */
#define R157_FTDM_OUT11_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R157_FTDM_OUT11_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R157_FTDM_OUT11_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R157_FTDM_OUT11_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R157_FTDM_OUT11_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R157_FTDM_OUT11_BYTE_OUT_POS_IC_1_MASK    0x3
#define R157_FTDM_OUT11_BYTE_OUT_POS_IC_1_SHIFT   0
#define R157_FTDM_OUT11_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R157_FTDM_OUT11_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R157_FTDM_OUT11_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R157_FTDM_OUT11_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R157_FTDM_OUT11_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R157_FTDM_OUT11_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R157_FTDM_OUT11_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R157_FTDM_OUT11_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT12 (IC 1) */
#define R158_FTDM_OUT12_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R158_FTDM_OUT12_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R158_FTDM_OUT12_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R158_FTDM_OUT12_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R158_FTDM_OUT12_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R158_FTDM_OUT12_BYTE_OUT_POS_IC_1_MASK    0x3
#define R158_FTDM_OUT12_BYTE_OUT_POS_IC_1_SHIFT   0
#define R158_FTDM_OUT12_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R158_FTDM_OUT12_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R158_FTDM_OUT12_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R158_FTDM_OUT12_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R158_FTDM_OUT12_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R158_FTDM_OUT12_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R158_FTDM_OUT12_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R158_FTDM_OUT12_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT13 (IC 1) */
#define R159_FTDM_OUT13_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R159_FTDM_OUT13_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R159_FTDM_OUT13_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R159_FTDM_OUT13_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R159_FTDM_OUT13_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R159_FTDM_OUT13_BYTE_OUT_POS_IC_1_MASK    0x3
#define R159_FTDM_OUT13_BYTE_OUT_POS_IC_1_SHIFT   0
#define R159_FTDM_OUT13_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R159_FTDM_OUT13_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R159_FTDM_OUT13_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R159_FTDM_OUT13_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R159_FTDM_OUT13_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R159_FTDM_OUT13_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R159_FTDM_OUT13_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R159_FTDM_OUT13_SLOT_ENABLE_OUT_IC_1_SHIFT 7

