nguyenhoabinhworkplace/ESP32_sigmastudio_control/teensy_sigmadsp_example_project_1.1.0/src/SigmaStudioFiles/Simple_SS_Project_145x_146x_INDIRECT_ACCESS_TABLE_IC_1_REG.h
/* FTDM_OUT14 (IC 1) */
#define R160_FTDM_OUT14_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R160_FTDM_OUT14_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R160_FTDM_OUT14_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R160_FTDM_OUT14_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R160_FTDM_OUT14_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R160_FTDM_OUT14_BYTE_OUT_POS_IC_1_MASK    0x3
#define R160_FTDM_OUT14_BYTE_OUT_POS_IC_1_SHIFT   0
#define R160_FTDM_OUT14_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R160_FTDM_OUT14_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R160_FTDM_OUT14_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R160_FTDM_OUT14_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R160_FTDM_OUT14_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R160_FTDM_OUT14_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R160_FTDM_OUT14_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R160_FTDM_OUT14_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT15 (IC 1) */
#define R161_FTDM_OUT15_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R161_FTDM_OUT15_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R161_FTDM_OUT15_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R161_FTDM_OUT15_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R161_FTDM_OUT15_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R161_FTDM_OUT15_BYTE_OUT_POS_IC_1_MASK    0x3
#define R161_FTDM_OUT15_BYTE_OUT_POS_IC_1_SHIFT   0
#define R161_FTDM_OUT15_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R161_FTDM_OUT15_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R161_FTDM_OUT15_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R161_FTDM_OUT15_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R161_FTDM_OUT15_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R161_FTDM_OUT15_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R161_FTDM_OUT15_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R161_FTDM_OUT15_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT16 (IC 1) */
#define R162_FTDM_OUT16_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R162_FTDM_OUT16_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R162_FTDM_OUT16_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R162_FTDM_OUT16_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R162_FTDM_OUT16_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R162_FTDM_OUT16_BYTE_OUT_POS_IC_1_MASK    0x3
#define R162_FTDM_OUT16_BYTE_OUT_POS_IC_1_SHIFT   0
#define R162_FTDM_OUT16_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R162_FTDM_OUT16_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R162_FTDM_OUT16_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R162_FTDM_OUT16_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R162_FTDM_OUT16_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R162_FTDM_OUT16_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R162_FTDM_OUT16_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R162_FTDM_OUT16_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT17 (IC 1) */
#define R163_FTDM_OUT17_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R163_FTDM_OUT17_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R163_FTDM_OUT17_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R163_FTDM_OUT17_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R163_FTDM_OUT17_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R163_FTDM_OUT17_BYTE_OUT_POS_IC_1_MASK    0x3
#define R163_FTDM_OUT17_BYTE_OUT_POS_IC_1_SHIFT   0
#define R163_FTDM_OUT17_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R163_FTDM_OUT17_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R163_FTDM_OUT17_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R163_FTDM_OUT17_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R163_FTDM_OUT17_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R163_FTDM_OUT17_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R163_FTDM_OUT17_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R163_FTDM_OUT17_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT18 (IC 1) */
#define R164_FTDM_OUT18_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R164_FTDM_OUT18_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R164_FTDM_OUT18_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R164_FTDM_OUT18_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R164_FTDM_OUT18_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R164_FTDM_OUT18_BYTE_OUT_POS_IC_1_MASK    0x3
#define R164_FTDM_OUT18_BYTE_OUT_POS_IC_1_SHIFT   0
#define R164_FTDM_OUT18_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R164_FTDM_OUT18_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R164_FTDM_OUT18_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R164_FTDM_OUT18_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R164_FTDM_OUT18_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R164_FTDM_OUT18_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R164_FTDM_OUT18_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R164_FTDM_OUT18_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT19 (IC 1) */
#define R165_FTDM_OUT19_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R165_FTDM_OUT19_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R165_FTDM_OUT19_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R165_FTDM_OUT19_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R165_FTDM_OUT19_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R165_FTDM_OUT19_BYTE_OUT_POS_IC_1_MASK    0x3
#define R165_FTDM_OUT19_BYTE_OUT_POS_IC_1_SHIFT   0
#define R165_FTDM_OUT19_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R165_FTDM_OUT19_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R165_FTDM_OUT19_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R165_FTDM_OUT19_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R165_FTDM_OUT19_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R165_FTDM_OUT19_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R165_FTDM_OUT19_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R165_FTDM_OUT19_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT20 (IC 1) */
#define R166_FTDM_OUT20_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R166_FTDM_OUT20_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R166_FTDM_OUT20_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R166_FTDM_OUT20_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R166_FTDM_OUT20_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R166_FTDM_OUT20_BYTE_OUT_POS_IC_1_MASK    0x3
#define R166_FTDM_OUT20_BYTE_OUT_POS_IC_1_SHIFT   0
#define R166_FTDM_OUT20_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R166_FTDM_OUT20_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R166_FTDM_OUT20_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R166_FTDM_OUT20_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R166_FTDM_OUT20_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R166_FTDM_OUT20_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R166_FTDM_OUT20_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R166_FTDM_OUT20_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT21 (IC 1) */
#define R167_FTDM_OUT21_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R167_FTDM_OUT21_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R167_FTDM_OUT21_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R167_FTDM_OUT21_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R167_FTDM_OUT21_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R167_FTDM_OUT21_BYTE_OUT_POS_IC_1_MASK    0x3
#define R167_FTDM_OUT21_BYTE_OUT_POS_IC_1_SHIFT   0
#define R167_FTDM_OUT21_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R167_FTDM_OUT21_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R167_FTDM_OUT21_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R167_FTDM_OUT21_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R167_FTDM_OUT21_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R167_FTDM_OUT21_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R167_FTDM_OUT21_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R167_FTDM_OUT21_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT22 (IC 1) */
#define R168_FTDM_OUT22_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R168_FTDM_OUT22_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R168_FTDM_OUT22_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R168_FTDM_OUT22_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R168_FTDM_OUT22_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R168_FTDM_OUT22_BYTE_OUT_POS_IC_1_MASK    0x3
#define R168_FTDM_OUT22_BYTE_OUT_POS_IC_1_SHIFT   0
#define R168_FTDM_OUT22_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R168_FTDM_OUT22_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R168_FTDM_OUT22_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R168_FTDM_OUT22_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R168_FTDM_OUT22_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R168_FTDM_OUT22_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R168_FTDM_OUT22_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R168_FTDM_OUT22_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT23 (IC 1) */
#define R169_FTDM_OUT23_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R169_FTDM_OUT23_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R169_FTDM_OUT23_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R169_FTDM_OUT23_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R169_FTDM_OUT23_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R169_FTDM_OUT23_BYTE_OUT_POS_IC_1_MASK    0x3
#define R169_FTDM_OUT23_BYTE_OUT_POS_IC_1_SHIFT   0
#define R169_FTDM_OUT23_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R169_FTDM_OUT23_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R169_FTDM_OUT23_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R169_FTDM_OUT23_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R169_FTDM_OUT23_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R169_FTDM_OUT23_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R169_FTDM_OUT23_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R169_FTDM_OUT23_SLOT_ENABLE_OUT_IC_1_SHIFT 7

