nguyenhoabinhworkplace/ESP32_sigmastudio_control/teensy_sigmadsp_example_project_1.1.0/src/SigmaStudioFiles/Simple_SS_Project_145x_146x_INDIRECT_ACCESS_TABLE_IC_1_REG.h
/* FTDM_OUT24 (IC 1) */
#define R170_FTDM_OUT24_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R170_FTDM_OUT24_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R170_FTDM_OUT24_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R170_FTDM_OUT24_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R170_FTDM_OUT24_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R170_FTDM_OUT24_BYTE_OUT_POS_IC_1_MASK    0x3
#define R170_FTDM_OUT24_BYTE_OUT_POS_IC_1_SHIFT   0
#define R170_FTDM_OUT24_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R170_FTDM_OUT24_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R170_FTDM_OUT24_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R170_FTDM_OUT24_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R170_FTDM_OUT24_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R170_FTDM_OUT24_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R170_FTDM_OUT24_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R170_FTDM_OUT24_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT25 (IC 1) */
#define R171_FTDM_OUT25_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R171_FTDM_OUT25_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R171_FTDM_OUT25_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R171_FTDM_OUT25_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R171_FTDM_OUT25_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R171_FTDM_OUT25_BYTE_OUT_POS_IC_1_MASK    0x3
#define R171_FTDM_OUT25_BYTE_OUT_POS_IC_1_SHIFT   0
#define R171_FTDM_OUT25_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R171_FTDM_OUT25_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R171_FTDM_OUT25_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R171_FTDM_OUT25_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R171_FTDM_OUT25_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R171_FTDM_OUT25_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R171_FTDM_OUT25_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R171_FTDM_OUT25_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT26 (IC 1) */
#define R172_FTDM_OUT26_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R172_FTDM_OUT26_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R172_FTDM_OUT26_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R172_FTDM_OUT26_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R172_FTDM_OUT26_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R172_FTDM_OUT26_BYTE_OUT_POS_IC_1_MASK    0x3
#define R172_FTDM_OUT26_BYTE_OUT_POS_IC_1_SHIFT   0
#define R172_FTDM_OUT26_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R172_FTDM_OUT26_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R172_FTDM_OUT26_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R172_FTDM_OUT26_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R172_FTDM_OUT26_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R172_FTDM_OUT26_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R172_FTDM_OUT26_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R172_FTDM_OUT26_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT27 (IC 1) */
#define R173_FTDM_OUT27_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R173_FTDM_OUT27_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R173_FTDM_OUT27_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R173_FTDM_OUT27_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R173_FTDM_OUT27_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R173_FTDM_OUT27_BYTE_OUT_POS_IC_1_MASK    0x3
#define R173_FTDM_OUT27_BYTE_OUT_POS_IC_1_SHIFT   0
#define R173_FTDM_OUT27_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R173_FTDM_OUT27_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R173_FTDM_OUT27_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R173_FTDM_OUT27_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R173_FTDM_OUT27_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R173_FTDM_OUT27_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R173_FTDM_OUT27_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R173_FTDM_OUT27_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT28 (IC 1) */
#define R174_FTDM_OUT28_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R174_FTDM_OUT28_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R174_FTDM_OUT28_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R174_FTDM_OUT28_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R174_FTDM_OUT28_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R174_FTDM_OUT28_BYTE_OUT_POS_IC_1_MASK    0x3
#define R174_FTDM_OUT28_BYTE_OUT_POS_IC_1_SHIFT   0
#define R174_FTDM_OUT28_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R174_FTDM_OUT28_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R174_FTDM_OUT28_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R174_FTDM_OUT28_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R174_FTDM_OUT28_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R174_FTDM_OUT28_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R174_FTDM_OUT28_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R174_FTDM_OUT28_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT29 (IC 1) */
#define R175_FTDM_OUT29_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R175_FTDM_OUT29_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R175_FTDM_OUT29_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R175_FTDM_OUT29_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R175_FTDM_OUT29_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R175_FTDM_OUT29_BYTE_OUT_POS_IC_1_MASK    0x3
#define R175_FTDM_OUT29_BYTE_OUT_POS_IC_1_SHIFT   0
#define R175_FTDM_OUT29_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R175_FTDM_OUT29_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R175_FTDM_OUT29_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R175_FTDM_OUT29_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R175_FTDM_OUT29_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R175_FTDM_OUT29_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R175_FTDM_OUT29_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R175_FTDM_OUT29_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT30 (IC 1) */
#define R176_FTDM_OUT30_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R176_FTDM_OUT30_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R176_FTDM_OUT30_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R176_FTDM_OUT30_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R176_FTDM_OUT30_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R176_FTDM_OUT30_BYTE_OUT_POS_IC_1_MASK    0x3
#define R176_FTDM_OUT30_BYTE_OUT_POS_IC_1_SHIFT   0
#define R176_FTDM_OUT30_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R176_FTDM_OUT30_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R176_FTDM_OUT30_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R176_FTDM_OUT30_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R176_FTDM_OUT30_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R176_FTDM_OUT30_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R176_FTDM_OUT30_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R176_FTDM_OUT30_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT31 (IC 1) */
#define R177_FTDM_OUT31_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R177_FTDM_OUT31_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R177_FTDM_OUT31_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R177_FTDM_OUT31_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R177_FTDM_OUT31_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R177_FTDM_OUT31_BYTE_OUT_POS_IC_1_MASK    0x3
#define R177_FTDM_OUT31_BYTE_OUT_POS_IC_1_SHIFT   0
#define R177_FTDM_OUT31_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R177_FTDM_OUT31_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R177_FTDM_OUT31_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R177_FTDM_OUT31_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R177_FTDM_OUT31_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R177_FTDM_OUT31_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R177_FTDM_OUT31_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R177_FTDM_OUT31_SLOT_ENABLE_OUT_IC_1_SHIFT 7

