nguyenhoabinhworkplace/ESP32_sigmastudio_control/teensy_sigmadsp_example_project_1.1.0/src/SigmaStudioFiles/Simple_SS_Project_145x_146x_INDIRECT_ACCESS_TABLE_IC_1_REG.h
/* FTDM_OUT52 (IC 1) */
#define R198_FTDM_OUT52_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R198_FTDM_OUT52_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R198_FTDM_OUT52_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R198_FTDM_OUT52_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R198_FTDM_OUT52_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R198_FTDM_OUT52_BYTE_OUT_POS_IC_1_MASK    0x3
#define R198_FTDM_OUT52_BYTE_OUT_POS_IC_1_SHIFT   0
#define R198_FTDM_OUT52_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R198_FTDM_OUT52_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R198_FTDM_OUT52_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R198_FTDM_OUT52_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R198_FTDM_OUT52_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R198_FTDM_OUT52_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R198_FTDM_OUT52_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R198_FTDM_OUT52_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT53 (IC 1) */
#define R199_FTDM_OUT53_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R199_FTDM_OUT53_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R199_FTDM_OUT53_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R199_FTDM_OUT53_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R199_FTDM_OUT53_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R199_FTDM_OUT53_BYTE_OUT_POS_IC_1_MASK    0x3
#define R199_FTDM_OUT53_BYTE_OUT_POS_IC_1_SHIFT   0
#define R199_FTDM_OUT53_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R199_FTDM_OUT53_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R199_FTDM_OUT53_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R199_FTDM_OUT53_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R199_FTDM_OUT53_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R199_FTDM_OUT53_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R199_FTDM_OUT53_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R199_FTDM_OUT53_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT54 (IC 1) */
#define R200_FTDM_OUT54_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R200_FTDM_OUT54_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R200_FTDM_OUT54_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R200_FTDM_OUT54_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R200_FTDM_OUT54_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R200_FTDM_OUT54_BYTE_OUT_POS_IC_1_MASK    0x3
#define R200_FTDM_OUT54_BYTE_OUT_POS_IC_1_SHIFT   0
#define R200_FTDM_OUT54_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R200_FTDM_OUT54_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R200_FTDM_OUT54_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R200_FTDM_OUT54_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R200_FTDM_OUT54_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R200_FTDM_OUT54_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R200_FTDM_OUT54_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R200_FTDM_OUT54_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT55 (IC 1) */
#define R201_FTDM_OUT55_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R201_FTDM_OUT55_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R201_FTDM_OUT55_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R201_FTDM_OUT55_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R201_FTDM_OUT55_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R201_FTDM_OUT55_BYTE_OUT_POS_IC_1_MASK    0x3
#define R201_FTDM_OUT55_BYTE_OUT_POS_IC_1_SHIFT   0
#define R201_FTDM_OUT55_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R201_FTDM_OUT55_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R201_FTDM_OUT55_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R201_FTDM_OUT55_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R201_FTDM_OUT55_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R201_FTDM_OUT55_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R201_FTDM_OUT55_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R201_FTDM_OUT55_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT56 (IC 1) */
#define R202_FTDM_OUT56_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R202_FTDM_OUT56_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R202_FTDM_OUT56_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R202_FTDM_OUT56_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R202_FTDM_OUT56_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R202_FTDM_OUT56_BYTE_OUT_POS_IC_1_MASK    0x3
#define R202_FTDM_OUT56_BYTE_OUT_POS_IC_1_SHIFT   0
#define R202_FTDM_OUT56_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R202_FTDM_OUT56_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R202_FTDM_OUT56_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R202_FTDM_OUT56_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R202_FTDM_OUT56_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R202_FTDM_OUT56_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R202_FTDM_OUT56_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R202_FTDM_OUT56_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT57 (IC 1) */
#define R203_FTDM_OUT57_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R203_FTDM_OUT57_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R203_FTDM_OUT57_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R203_FTDM_OUT57_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R203_FTDM_OUT57_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R203_FTDM_OUT57_BYTE_OUT_POS_IC_1_MASK    0x3
#define R203_FTDM_OUT57_BYTE_OUT_POS_IC_1_SHIFT   0
#define R203_FTDM_OUT57_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R203_FTDM_OUT57_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R203_FTDM_OUT57_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R203_FTDM_OUT57_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R203_FTDM_OUT57_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R203_FTDM_OUT57_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R203_FTDM_OUT57_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R203_FTDM_OUT57_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT58 (IC 1) */
#define R204_FTDM_OUT58_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R204_FTDM_OUT58_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R204_FTDM_OUT58_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R204_FTDM_OUT58_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R204_FTDM_OUT58_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R204_FTDM_OUT58_BYTE_OUT_POS_IC_1_MASK    0x3
#define R204_FTDM_OUT58_BYTE_OUT_POS_IC_1_SHIFT   0
#define R204_FTDM_OUT58_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R204_FTDM_OUT58_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R204_FTDM_OUT58_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R204_FTDM_OUT58_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R204_FTDM_OUT58_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R204_FTDM_OUT58_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R204_FTDM_OUT58_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R204_FTDM_OUT58_SLOT_ENABLE_OUT_IC_1_SHIFT 7

