nguyenhoabinhworkplace/ESP32_sigmastudio_control/teensy_sigmadsp_example_project_1.1.0/src/SigmaStudioFiles/Simple_SS_Project_145x_146x_INDIRECT_ACCESS_TABLE_IC_1_REG.h
/* SPDIF_TX_UD_RIGHT_2 (IC 1) */
#define R501_SPDIF_TX_UD_RIGHT_2_SPDIF_TX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R501_SPDIF_TX_UD_RIGHT_2_SPDIF_TX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R501_SPDIF_TX_UD_RIGHT_2_SPDIF_TX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_UD_RIGHT_3 (IC 1) */
#define R502_SPDIF_TX_UD_RIGHT_3_SPDIF_TX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R502_SPDIF_TX_UD_RIGHT_3_SPDIF_TX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R502_SPDIF_TX_UD_RIGHT_3_SPDIF_TX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_UD_RIGHT_4 (IC 1) */
#define R503_SPDIF_TX_UD_RIGHT_4_SPDIF_TX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R503_SPDIF_TX_UD_RIGHT_4_SPDIF_TX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R503_SPDIF_TX_UD_RIGHT_4_SPDIF_TX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_UD_RIGHT_5 (IC 1) */
#define R504_SPDIF_TX_UD_RIGHT_5_SPDIF_TX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R504_SPDIF_TX_UD_RIGHT_5_SPDIF_TX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R504_SPDIF_TX_UD_RIGHT_5_SPDIF_TX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_UD_RIGHT_6 (IC 1) */
#define R505_SPDIF_TX_UD_RIGHT_6_SPDIF_TX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R505_SPDIF_TX_UD_RIGHT_6_SPDIF_TX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R505_SPDIF_TX_UD_RIGHT_6_SPDIF_TX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_UD_RIGHT_7 (IC 1) */
#define R506_SPDIF_TX_UD_RIGHT_7_SPDIF_TX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R506_SPDIF_TX_UD_RIGHT_7_SPDIF_TX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R506_SPDIF_TX_UD_RIGHT_7_SPDIF_TX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_UD_RIGHT_8 (IC 1) */
#define R507_SPDIF_TX_UD_RIGHT_8_SPDIF_TX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R507_SPDIF_TX_UD_RIGHT_8_SPDIF_TX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R507_SPDIF_TX_UD_RIGHT_8_SPDIF_TX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_UD_RIGHT_9 (IC 1) */
#define R508_SPDIF_TX_UD_RIGHT_9_SPDIF_TX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R508_SPDIF_TX_UD_RIGHT_9_SPDIF_TX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R508_SPDIF_TX_UD_RIGHT_9_SPDIF_TX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_UD_RIGHT_10 (IC 1) */
#define R509_SPDIF_TX_UD_RIGHT_10_SPDIF_TX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R509_SPDIF_TX_UD_RIGHT_10_SPDIF_TX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R509_SPDIF_TX_UD_RIGHT_10_SPDIF_TX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_UD_RIGHT_11 (IC 1) */
#define R510_SPDIF_TX_UD_RIGHT_11_SPDIF_TX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R510_SPDIF_TX_UD_RIGHT_11_SPDIF_TX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R510_SPDIF_TX_UD_RIGHT_11_SPDIF_TX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_VB_LEFT_0 (IC 1) */
#define R511_SPDIF_TX_VB_LEFT_0_SPDIF_TX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R511_SPDIF_TX_VB_LEFT_0_SPDIF_TX_VB_LEFT_IC_1_MASK 0xFFFF
#define R511_SPDIF_TX_VB_LEFT_0_SPDIF_TX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_VB_LEFT_1 (IC 1) */
#define R512_SPDIF_TX_VB_LEFT_1_SPDIF_TX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R512_SPDIF_TX_VB_LEFT_1_SPDIF_TX_VB_LEFT_IC_1_MASK 0xFFFF
#define R512_SPDIF_TX_VB_LEFT_1_SPDIF_TX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_VB_LEFT_2 (IC 1) */
#define R513_SPDIF_TX_VB_LEFT_2_SPDIF_TX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R513_SPDIF_TX_VB_LEFT_2_SPDIF_TX_VB_LEFT_IC_1_MASK 0xFFFF
#define R513_SPDIF_TX_VB_LEFT_2_SPDIF_TX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_VB_LEFT_3 (IC 1) */
#define R514_SPDIF_TX_VB_LEFT_3_SPDIF_TX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R514_SPDIF_TX_VB_LEFT_3_SPDIF_TX_VB_LEFT_IC_1_MASK 0xFFFF
#define R514_SPDIF_TX_VB_LEFT_3_SPDIF_TX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_VB_LEFT_4 (IC 1) */
#define R515_SPDIF_TX_VB_LEFT_4_SPDIF_TX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R515_SPDIF_TX_VB_LEFT_4_SPDIF_TX_VB_LEFT_IC_1_MASK 0xFFFF
#define R515_SPDIF_TX_VB_LEFT_4_SPDIF_TX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_VB_LEFT_5 (IC 1) */
#define R516_SPDIF_TX_VB_LEFT_5_SPDIF_TX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R516_SPDIF_TX_VB_LEFT_5_SPDIF_TX_VB_LEFT_IC_1_MASK 0xFFFF
#define R516_SPDIF_TX_VB_LEFT_5_SPDIF_TX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_VB_LEFT_6 (IC 1) */
#define R517_SPDIF_TX_VB_LEFT_6_SPDIF_TX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R517_SPDIF_TX_VB_LEFT_6_SPDIF_TX_VB_LEFT_IC_1_MASK 0xFFFF
#define R517_SPDIF_TX_VB_LEFT_6_SPDIF_TX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_VB_LEFT_7 (IC 1) */
#define R518_SPDIF_TX_VB_LEFT_7_SPDIF_TX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R518_SPDIF_TX_VB_LEFT_7_SPDIF_TX_VB_LEFT_IC_1_MASK 0xFFFF
#define R518_SPDIF_TX_VB_LEFT_7_SPDIF_TX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_VB_LEFT_8 (IC 1) */
#define R519_SPDIF_TX_VB_LEFT_8_SPDIF_TX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R519_SPDIF_TX_VB_LEFT_8_SPDIF_TX_VB_LEFT_IC_1_MASK 0xFFFF
#define R519_SPDIF_TX_VB_LEFT_8_SPDIF_TX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_VB_LEFT_9 (IC 1) */
#define R520_SPDIF_TX_VB_LEFT_9_SPDIF_TX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R520_SPDIF_TX_VB_LEFT_9_SPDIF_TX_VB_LEFT_IC_1_MASK 0xFFFF
#define R520_SPDIF_TX_VB_LEFT_9_SPDIF_TX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_VB_LEFT_10 (IC 1) */
#define R521_SPDIF_TX_VB_LEFT_10_SPDIF_TX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R521_SPDIF_TX_VB_LEFT_10_SPDIF_TX_VB_LEFT_IC_1_MASK 0xFFFF
#define R521_SPDIF_TX_VB_LEFT_10_SPDIF_TX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_VB_LEFT_11 (IC 1) */
#define R522_SPDIF_TX_VB_LEFT_11_SPDIF_TX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R522_SPDIF_TX_VB_LEFT_11_SPDIF_TX_VB_LEFT_IC_1_MASK 0xFFFF
#define R522_SPDIF_TX_VB_LEFT_11_SPDIF_TX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_VB_RIGHT_0 (IC 1) */
#define R523_SPDIF_TX_VB_RIGHT_0_SPDIF_TX_VB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R523_SPDIF_TX_VB_RIGHT_0_SPDIF_TX_VB_RIGHT_IC_1_MASK 0xFFFF
#define R523_SPDIF_TX_VB_RIGHT_0_SPDIF_TX_VB_RIGHT_IC_1_SHIFT 0

