nguyenhoabinhworkplace/ESP32_sigmastudio_control/teensy_sigmadsp_example_project_1.1.0/src/SigmaStudioFiles/Simple_SS_Project_145x_146x_INDIRECT_ACCESS_TABLE_IC_1_REG.h
/* SPDIF_TX_VB_RIGHT_1 (IC 1) */
#define R524_SPDIF_TX_VB_RIGHT_1_SPDIF_TX_VB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R524_SPDIF_TX_VB_RIGHT_1_SPDIF_TX_VB_RIGHT_IC_1_MASK 0xFFFF
#define R524_SPDIF_TX_VB_RIGHT_1_SPDIF_TX_VB_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_VB_RIGHT_2 (IC 1) */
#define R525_SPDIF_TX_VB_RIGHT_2_SPDIF_TX_VB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R525_SPDIF_TX_VB_RIGHT_2_SPDIF_TX_VB_RIGHT_IC_1_MASK 0xFFFF
#define R525_SPDIF_TX_VB_RIGHT_2_SPDIF_TX_VB_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_VB_RIGHT_3 (IC 1) */
#define R526_SPDIF_TX_VB_RIGHT_3_SPDIF_TX_VB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R526_SPDIF_TX_VB_RIGHT_3_SPDIF_TX_VB_RIGHT_IC_1_MASK 0xFFFF
#define R526_SPDIF_TX_VB_RIGHT_3_SPDIF_TX_VB_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_VB_RIGHT_4 (IC 1) */
#define R527_SPDIF_TX_VB_RIGHT_4_SPDIF_TX_VB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R527_SPDIF_TX_VB_RIGHT_4_SPDIF_TX_VB_RIGHT_IC_1_MASK 0xFFFF
#define R527_SPDIF_TX_VB_RIGHT_4_SPDIF_TX_VB_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_VB_RIGHT_5 (IC 1) */
#define R528_SPDIF_TX_VB_RIGHT_5_SPDIF_TX_VB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R528_SPDIF_TX_VB_RIGHT_5_SPDIF_TX_VB_RIGHT_IC_1_MASK 0xFFFF
#define R528_SPDIF_TX_VB_RIGHT_5_SPDIF_TX_VB_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_VB_RIGHT_6 (IC 1) */
#define R529_SPDIF_TX_VB_RIGHT_6_SPDIF_TX_VB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R529_SPDIF_TX_VB_RIGHT_6_SPDIF_TX_VB_RIGHT_IC_1_MASK 0xFFFF
#define R529_SPDIF_TX_VB_RIGHT_6_SPDIF_TX_VB_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_VB_RIGHT_7 (IC 1) */
#define R530_SPDIF_TX_VB_RIGHT_7_SPDIF_TX_VB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R530_SPDIF_TX_VB_RIGHT_7_SPDIF_TX_VB_RIGHT_IC_1_MASK 0xFFFF
#define R530_SPDIF_TX_VB_RIGHT_7_SPDIF_TX_VB_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_VB_RIGHT_8 (IC 1) */
#define R531_SPDIF_TX_VB_RIGHT_8_SPDIF_TX_VB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R531_SPDIF_TX_VB_RIGHT_8_SPDIF_TX_VB_RIGHT_IC_1_MASK 0xFFFF
#define R531_SPDIF_TX_VB_RIGHT_8_SPDIF_TX_VB_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_VB_RIGHT_9 (IC 1) */
#define R532_SPDIF_TX_VB_RIGHT_9_SPDIF_TX_VB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R532_SPDIF_TX_VB_RIGHT_9_SPDIF_TX_VB_RIGHT_IC_1_MASK 0xFFFF
#define R532_SPDIF_TX_VB_RIGHT_9_SPDIF_TX_VB_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_VB_RIGHT_10 (IC 1) */
#define R533_SPDIF_TX_VB_RIGHT_10_SPDIF_TX_VB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R533_SPDIF_TX_VB_RIGHT_10_SPDIF_TX_VB_RIGHT_IC_1_MASK 0xFFFF
#define R533_SPDIF_TX_VB_RIGHT_10_SPDIF_TX_VB_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_VB_RIGHT_11 (IC 1) */
#define R534_SPDIF_TX_VB_RIGHT_11_SPDIF_TX_VB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R534_SPDIF_TX_VB_RIGHT_11_SPDIF_TX_VB_RIGHT_IC_1_MASK 0xFFFF
#define R534_SPDIF_TX_VB_RIGHT_11_SPDIF_TX_VB_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_PB_LEFT_0 (IC 1) */
#define R535_SPDIF_TX_PB_LEFT_0_SPDIF_TX_PB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R535_SPDIF_TX_PB_LEFT_0_SPDIF_TX_PB_LEFT_IC_1_MASK 0xFFFF
#define R535_SPDIF_TX_PB_LEFT_0_SPDIF_TX_PB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_PB_LEFT_1 (IC 1) */
#define R536_SPDIF_TX_PB_LEFT_1_SPDIF_TX_PB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R536_SPDIF_TX_PB_LEFT_1_SPDIF_TX_PB_LEFT_IC_1_MASK 0xFFFF
#define R536_SPDIF_TX_PB_LEFT_1_SPDIF_TX_PB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_PB_LEFT_2 (IC 1) */
#define R537_SPDIF_TX_PB_LEFT_2_SPDIF_TX_PB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R537_SPDIF_TX_PB_LEFT_2_SPDIF_TX_PB_LEFT_IC_1_MASK 0xFFFF
#define R537_SPDIF_TX_PB_LEFT_2_SPDIF_TX_PB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_PB_LEFT_3 (IC 1) */
#define R538_SPDIF_TX_PB_LEFT_3_SPDIF_TX_PB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R538_SPDIF_TX_PB_LEFT_3_SPDIF_TX_PB_LEFT_IC_1_MASK 0xFFFF
#define R538_SPDIF_TX_PB_LEFT_3_SPDIF_TX_PB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_PB_LEFT_4 (IC 1) */
#define R539_SPDIF_TX_PB_LEFT_4_SPDIF_TX_PB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R539_SPDIF_TX_PB_LEFT_4_SPDIF_TX_PB_LEFT_IC_1_MASK 0xFFFF
#define R539_SPDIF_TX_PB_LEFT_4_SPDIF_TX_PB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_PB_LEFT_5 (IC 1) */
#define R540_SPDIF_TX_PB_LEFT_5_SPDIF_TX_PB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R540_SPDIF_TX_PB_LEFT_5_SPDIF_TX_PB_LEFT_IC_1_MASK 0xFFFF
#define R540_SPDIF_TX_PB_LEFT_5_SPDIF_TX_PB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_PB_LEFT_6 (IC 1) */
#define R541_SPDIF_TX_PB_LEFT_6_SPDIF_TX_PB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R541_SPDIF_TX_PB_LEFT_6_SPDIF_TX_PB_LEFT_IC_1_MASK 0xFFFF
#define R541_SPDIF_TX_PB_LEFT_6_SPDIF_TX_PB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_PB_LEFT_7 (IC 1) */
#define R542_SPDIF_TX_PB_LEFT_7_SPDIF_TX_PB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R542_SPDIF_TX_PB_LEFT_7_SPDIF_TX_PB_LEFT_IC_1_MASK 0xFFFF
#define R542_SPDIF_TX_PB_LEFT_7_SPDIF_TX_PB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_PB_LEFT_8 (IC 1) */
#define R543_SPDIF_TX_PB_LEFT_8_SPDIF_TX_PB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R543_SPDIF_TX_PB_LEFT_8_SPDIF_TX_PB_LEFT_IC_1_MASK 0xFFFF
#define R543_SPDIF_TX_PB_LEFT_8_SPDIF_TX_PB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_PB_LEFT_9 (IC 1) */
#define R544_SPDIF_TX_PB_LEFT_9_SPDIF_TX_PB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R544_SPDIF_TX_PB_LEFT_9_SPDIF_TX_PB_LEFT_IC_1_MASK 0xFFFF
#define R544_SPDIF_TX_PB_LEFT_9_SPDIF_TX_PB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_PB_LEFT_10 (IC 1) */
#define R545_SPDIF_TX_PB_LEFT_10_SPDIF_TX_PB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R545_SPDIF_TX_PB_LEFT_10_SPDIF_TX_PB_LEFT_IC_1_MASK 0xFFFF
#define R545_SPDIF_TX_PB_LEFT_10_SPDIF_TX_PB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_PB_LEFT_11 (IC 1) */
#define R546_SPDIF_TX_PB_LEFT_11_SPDIF_TX_PB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R546_SPDIF_TX_PB_LEFT_11_SPDIF_TX_PB_LEFT_IC_1_MASK 0xFFFF
#define R546_SPDIF_TX_PB_LEFT_11_SPDIF_TX_PB_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_PB_RIGHT_0 (IC 1) */
#define R547_SPDIF_TX_PB_RIGHT_0_SPDIF_TX_PB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R547_SPDIF_TX_PB_RIGHT_0_SPDIF_TX_PB_RIGHT_IC_1_MASK 0xFFFF
#define R547_SPDIF_TX_PB_RIGHT_0_SPDIF_TX_PB_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_PB_RIGHT_1 (IC 1) */
#define R548_SPDIF_TX_PB_RIGHT_1_SPDIF_TX_PB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R548_SPDIF_TX_PB_RIGHT_1_SPDIF_TX_PB_RIGHT_IC_1_MASK 0xFFFF
#define R548_SPDIF_TX_PB_RIGHT_1_SPDIF_TX_PB_RIGHT_IC_1_SHIFT 0

